{ "results": [
	{
        "createdAt": "2015-10-03T01:58:42.880Z",
        "date": 5,
        "expanded": "Wow, this girl is SO easy to talk to. Completely craved a deeper level of conversation. Our conversation took a deep dive into more personal experiences pretty early into our time, and she wasn't weird or awkward about it at all. She was so intrigued to hear and learn some wisdom I've gleaned as she asked me some questions. I was pretty flattered. Now that I'm looking back, I'm not sure if she was intentionally trying to flatter me to make me enjoy the coffee date more (though it didn't feel like that at the time, and her interest totally felt genuine), but either way, it was freakin smart!! I would def grab coffee with her again. Loved hearing about her time abroad, her interactions with Guy, her renewed sense of connection to Jewish culture at Princeton, her opinions about exclusivity, the Street, drugs, etc etc such a wide range of topics. I didn't want it to end! Would be interested to hear more from people who know her on a more consistent personal level.",
        "hall": 4,
        "meeting": 4,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "9tRoCjmjnJ"
        },
        "objectId": "0kHtfF7q52",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "cCORD4pTj3"
        },
        "updatedAt": "2015-10-03T01:58:42.880Z"
    },
	{
        "createdAt": "2015-10-07T19:19:23.658Z",
        "date": 4,
        "expanded": "Sebastian is a really cool kid with a really interesting background. He sings opera and wants to be a screenwriter/work in film but studies neuroscience here on campus. He's from Australia/the UK so we ended up talking a lot about bing transported into the weird world that is Princeton. He isn't really attached to any social group and has found it really odd how people at Princeton immediately latch onto the people who they do activities with and other odd affiliations in order to discover who they are. He has a really strong sense of self and isn't afraid to do his own thing, and treats Princeton as it should be--school, not your entire life. He is incredibly independent and while I don't think he needs a group at Princeton, I think a group of different types of individuals would be really good for him. He also has a pretty positive and interesting way of seeing the world around him--I was pretty taken aback by his praise for his all boys boarding school that is known for being pretty douchey--but taken aback in a good way. He didn't discredit people for having wild, extravagant, wealthy lives despite him not growing up that way. He just sees everything in colorful and interesting stories, which I think can be really productive in terms of meeting new and different people. Something that I didn't enjoy as much is that it often felt like an interview, and he didn't ask me many questions/I barely spoke during our coffee date. He gave me a great image of who he was, but I would have liked to have had more of a back and forth conversation to better understand my relationship to him instead of his relationship to the world as a whole.",
        "hall": 4,
        "meeting": 5,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "3EhJDbwCry"
        },
        "objectId": "0ysXEWEB6i",
        "pb": 4,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "U4IpoGXw5T"
        },
        "updatedAt": "2015-10-07T19:19:23.658Z"
    },
	{
        "createdAt": "2015-09-30T01:51:23.399Z",
        "date": 5,
        "expanded": "Camila is a wonderful girl and one of the few coffee dates I've had where I think the individual needs the Hall. There are a couple of things that I really enjoyed about our date, but to even write them down does not do the conversation justice. We started off by talking about growing up in New York City, being from Mexico and having culturally Mexican parents, Camila could relate about the opposing cultures and the tension it caused. I think it was at this point that I thought: \"She's someone I could give my PB to.\" The second part of our conversation dealt with Princeton and the struggles of surviving. Unlike some people (for whom Princeton is a struggle but seem to just like to be a part of the culture of complaint), I could see a lot of similarities between my younger self and her. Specifically feeling trapped in unsettling friendships. Finally, we dove into some heavy conversation about personal matters that I think really demonstrated her ability to listen and to be a person who anyone could give a PB to. Last point, I could really see her being someone to subtly define a pledge class, in a way that is not overbearing but would be a good glue.",
        "hall": 5,
        "meeting": 5,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "xt5DyqVpe4"
        },
        "objectId": "1VeZlvQ8X3",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "CksZqHste9"
        },
        "updatedAt": "2015-09-30T01:51:23.399Z"
    },
	{
        "createdAt": "2015-10-04T21:16:05.108Z",
        "date": 4,
        "expanded": "Max is someone who takes a little while to open up, but is really funny and odd in an endearing way once you do. He seemed a bit distracted and nervous when we first began talking, but he soon opened up about WPRB, his summer in Berlin, and being a Philosophy major. He seems to be a lone soldier and not concerned with what everyone else around him is doing, and I appreciate that. He does things because they interest him. We talked a lot about his love for the Who, all the foods one should eat in Berlin, and made up loads of band names including \"Fuckloads of Schnitzel.\" I had a fun time with him, and was glad that I got to meet him through this coffee date because I am not sure how easy it would have been for him to open up and talk to me in other circumstances. With that being said, I'm not sure how he would respond to the overwhelming environment that the Hall is once pledging begins. I'm curious to see how others perceive that with him. I think it would be nice for someone else to coffee date him and see how they get on. I'm not sure how much he would open up in meeting but nevertheless he would be a quirky and interesting personality to have around.",
        "hall": 3,
        "meeting": 3,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "3EhJDbwCry"
        },
        "objectId": "1sGpGZEtFH",
        "pb": 3,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "PemcUzabRO"
        },
        "updatedAt": "2015-10-04T21:16:05.108Z"
    },
	{
        "createdAt": "2015-10-08T20:13:00.637Z",
        "date": 3,
        "expanded": "Allison was nice and the conversation was amicable, but there was nothing really extraordinary about our conversation in general. She's a nice girl but there was a lack of FIRE - an inextinguishable energy about life. It felt sort of... blah... the whole time. I don't really have too much to say about it.",
        "hall": 2,
        "meeting": 2,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "SmBf5on1pc"
        },
        "objectId": "2DJaAm0vqs",
        "pb": 2,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "4ztTSRITYT"
        },
        "updatedAt": "2015-10-08T20:13:00.637Z"
    },
	{
        "createdAt": "2015-10-06T21:46:13.185Z",
        "date": 5,
        "expanded": "All around ideal candidate for this group of people. I can imagine him at all of A's events, and not just there, but adding to each of them. At first I thought he might just be a goofball, but I honestly think he is one of the most intelligent people I've spent time with on campus. Also, he genuinely appreciates and reveres Conor McGrory. I don't think I have to say much, because I think most members have seen him speak for himself.",
        "hall": 5,
        "meeting": 5,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "kSGEshJdTB"
        },
        "objectId": "2QNLZDfkJm",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "FsH7g9FHG9"
        },
        "updatedAt": "2015-10-06T21:46:13.185Z"
    },
	{
        "createdAt": "2015-10-08T02:11:38.548Z",
        "date": 4,
        "expanded": "Seemed nice, thoughtful. Did bridge year peru, has a peruvian father. wants to be a public defender, seemed to have good political insight. seemed like a good listener, but was a little overly theatrical / reactions seemed less than genuine at times.",
        "hall": 3,
        "meeting": 3,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "kldlMuEeNt"
        },
        "objectId": "2kP2wkAV3x",
        "pb": 3,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "Acw94Mc4T5"
        },
        "updatedAt": "2015-10-08T02:11:38.548Z"
    },
	{
        "createdAt": "2015-09-26T18:24:39.403Z",
        "date": 4,
        "expanded": "Jeremy was a really great guy to spend almost an hour and half with. We talked about everything from breakfast burritos to the issues surrounding education. We talked about \"white savior complex\" and about conforming to others' standards of what is cool. Our conversation was complex and riveting. He also has a really great sense of humor and fun. He seems really self-aware and reflective. He told me the story of coming out as bisexual this summer and how the reactions of his friends/family has shaped their relationships since. He also was so confident and easy to talk to. I like Jeremy a lot.",
        "hall": 4,
        "meeting": 4,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "pAMJgmz7nJ"
        },
        "objectId": "3eqWmW7KeS",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "z3r4gU2oj6"
        },
        "updatedAt": "2015-09-26T18:24:39.403Z"
    },
	{
        "createdAt": "2015-10-01T19:33:31.568Z",
        "date": 4,
        "expanded": "I want to start off by saying that Victoria is super sweet. We had a very good conversation--one that you would expect with a stranger. We did not stray from from the superficial and that could be for a number of reasons including a) we don't know each other b) she does not share with people she doesn't know. Despite her kindness and earnest nature, I do not really see her being a good fit for the Hall. She is the kind of person who thrives at Princeton (not saying the Hall does not need or have that) but it is in a way that comes off a little uninspired. She has fascinating interests from computer science to music but does not (at least not in the same way as many in the Hall) seem particularly excited about it. I think this is sounding quite harsh but really all I want to say is that even though she is great, cool, and funny, I do not see her being a member. \n\nAlso, this could just be a pet peeve of mine but she does this thing in conversation where she tries to trail the end of your sentence (but it could have been nerves!)",
        "hall": 3,
        "meeting": 3,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "xt5DyqVpe4"
        },
        "objectId": "3g3i6qQWBu",
        "pb": 3,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "DhbcvjSVjN"
        },
        "updatedAt": "2015-10-01T19:33:31.568Z"
    },
	{
        "createdAt": "2015-09-28T01:57:02.816Z",
        "date": 4,
        "expanded": "To begin, I think that Reva definitely deserves another coffee date--I would be interested to hear what another member of the Hall thought about her. On the whole, I really enjoyed my coffee date with Reva. However, it was not magical (not that all of these need to be). I felt as though we were having a conversation that I really could have had with many individuals on campus. She is interesting, she does cool activities, but I did not feel engaged. While I think she would be a good member of the Hall, I did not feel as though she needed it as much in terms of community.",
        "hall": 3,
        "meeting": 3,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "xt5DyqVpe4"
        },
        "objectId": "44JAHhSSEO",
        "pb": 3,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "aemfJd4d33"
        },
        "updatedAt": "2015-09-28T01:57:02.816Z"
    },
	{
        "createdAt": "2015-09-28T19:24:30.099Z",
        "date": 4,
        "expanded": "I think Eric was a really passionate and driven person. He started his own film production company during his senior year of high school and is really involved with film here on campus. We talked about that mostly--his love of the craft and his decision to come to Princeton instead of going to film school. He comes off as extremely poised and well spoken and seems to really know what he wants in life. Our conversation was a bit one sided, with him mostly telling me about himself, but I'm not sure if he is to blame for that (not that it's really a fault). I didn't click with him exceptionally but really enjoyed talking to him and think it would be great for him to speak to others. I could see him really contributing during meeting as he has a lot of ideas and isn't afraid to share them. Overall, good coffee date.",
        "hall": 4,
        "meeting": 4,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "3EhJDbwCry"
        },
        "objectId": "5ImY1hDB3K",
        "pb": 3,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "CVtbhwZHWG"
        },
        "updatedAt": "2015-09-28T19:24:30.099Z"
    },
	{
        "createdAt": "2015-09-29T14:51:20.832Z",
        "date": 4,
        "expanded": "I really liked Mitch. He is my second coffee date (I think it's important I give you a narrative of my coffee dates, since I'm still feeling out how this evaluation process works). I like him best thus far because he is both a good listener and he puts forward his own ideas. He disagreed with me on a number of points and was focused on bringing up his own experiences related to what we were talking about. So, he's anecdotal and also a critical thinker (he didn't take everything I said lying down), which would be good in meeting. He's contemplative, which is good, and he has a good sense of humor (which I super appreciate) and isn't focused on just talking about himself...but he definitely has opinions. Not everybody does! I hypothesize that in meeting he'd listen for a while, and then point out subtleties or disagree with people without being aggressive and with a certain judiciousness.\n\nHis background is really interesting. He is in Umqlombothi (sp?), participated in the Black Lives Matter movement, but isn't afraid to ask questions about why he participated and what participation means on Princeton's campus. Also heavily involved in PUO on the tuba! He did the Juilliard prep program in high school, commuting to New York each Saturday. He will probably major in COS but he's interested in getting a German certificate. He had just come from a coffee date with a professor when I met up with him. I think that's a good sign in that being curious about / reaching out to professors is indicative of a certain maturity level and a desire to really experience this place for all it has, which not many students ever feel like they have the time to do. \n\nThat said, I don't think Mitch struck me as the most controversial of people. He was certainly more of an active participant in the conversation than my last coffee date was (Alex). But he has probably a more active personality. The conversation flowed very nicely. It felt much more exploratory than many conversations I've had recently. We didn't come to conclusions about anything, but we did share our experiences and our doubts about the topics we were discussing - a lot of that was actually the Black Lives Matter movement, from the walk-out to turning one's back on Eisgruber, as well as the rainbow filter that flooded Facebook following the gay marriage Supreme Court decision this summer (basically, the nature of social justice movements and their militancy). He wasn't afraid to have this conversation with me even though it was obviously a very delicate subject matter. And he was honest about his feelings and self-critical and offered anecdotes when he didn't feel like he could give answers; though it's possible he behaved that way since I set that sort of tone at the beginning of the conversation.\n\nHonestly I am starting to worry that I will give all my coffee dates 4s because I can't imagine really disliking a person. I'm not sure how to spin the conversation such that I have some kind of bland format from which I can compare the nature of all the coffee datees. This is troubling me. \n\nI personally like Mitch a lot. I think he is contemplative, kind, empathetic, and self-critical - all good things. He embraces ambiguity and I think has been participating in a lot of important conversations on campus. He seems to try to see things from every side. Talking to him brought out a more judicious and honest version of myself, which can only be a good thing. I would defer to Sydney and Achille's judgment on him, since they know him best, but I think he would be a good member of the organization.",
        "hall": 4,
        "meeting": 4,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "BXD5r0f12R"
        },
        "objectId": "6Az1u8NFor",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "J91jseEdNF"
        },
        "updatedAt": "2015-09-29T14:51:20.832Z"
    },
	{
        "createdAt": "2015-10-04T21:11:23.380Z",
        "date": 3,
        "expanded": "Lauren is a really sweet, bubbly, and fun person and I had a pretty nice time on our coffee date. With that being said, I don't think our conversation ever delved into anything of much substance, we kind of kept it to small talk/pleasantries. I learned she is pretty young for her year (still 18!) and does a lot with Whitman college council. She has a quick wit and a great sense of humor that I really enjoyed, I felt comfortable around her. Still, I am not sure how much she would contribute to meeting besides being a nice and friendly person to be around. I'm sure that someone else would have a deeper connection with her, but I don't think we ever got to that point.",
        "hall": 4,
        "meeting": 2,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "3EhJDbwCry"
        },
        "objectId": "6YHd64BZEn",
        "pb": 3,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "Rv1a36NWKZ"
        },
        "updatedAt": "2015-10-04T21:11:23.380Z"
    },
	{
        "createdAt": "2015-10-06T14:38:56.696Z",
        "date": 5,
        "expanded": "My coffee date with Sam was quite nice. On the overall, I really like him as a person and think that everyone in the Hall should get to know him at one point or another. He is incredibly sweet and a great conversationalist. With all of that said however, I do think that at the end of the day there are better people not just fit for the hall but who need As more than Sam does. I honestly have nothing negative to say about him. In fact, he is a kid who has a diverse range of experiences and seems like he genuinely loves people. I guess what I am trying to say is that I would need to see the class make up before making a call.",
        "hall": 4,
        "meeting": 4,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "xt5DyqVpe4"
        },
        "objectId": "6anpb653aD",
        "pb": 4,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "qJbJPzwwwb"
        },
        "updatedAt": "2015-10-06T14:38:56.696Z"
    },
	{
        "createdAt": "2015-10-05T04:00:07.643Z",
        "date": 4,
        "expanded": "Alex is a really awesome person. I was stressed and in a pretty crap mood when we met but her warmth and positivity actually made me a feel a lot better. I felt completely comfortable talking with her she has a very chill demeanour and seemed genuinely interested to hear my thoughts on everything we talked about, including the American political system and party structures and how it all compares with the UK etc etc. Writing that up makes it sound pretty dry but I was actually stoked to be talking about it at the time and I think that was because I instantly felt so comfortable around Alex. We also had a pretty candid chat about her frustrations as a USG member. Funnily enough, she said her committee is starting something called Tough Chats, which will be a forum for talking about issues that many of us usually avoid, but she also expressed regret that she felt like the program wasn't going to reach the people that would actually most benefit from it. I thought that was pretty cool and it seemed like she is someone who wants to bring her friends and community into those conversations and I think that is a quality that fits in pretty well with this group.",
        "hall": 5,
        "meeting": 4,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "55fH46Ihxf"
        },
        "objectId": "6qJt7u1pnk",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "Acw94Mc4T5"
        },
        "updatedAt": "2015-10-05T04:00:07.643Z"
    },
	{
        "createdAt": "2015-09-30T18:23:29.857Z",
        "date": 4,
        "expanded": "Lauren is a really interesting girl but, unfortunately, we only met for about half an hour because she had mandatory training for a community service projects that she works on. Lauren was pretty reflective talking about her childhood in LA and transitioning from focusing entirely on sports (at times she did 3 practices a day) in high school to working for various service projects across campus (Petey Greene, Big Sibs). I felt like Lauren was holding back a little and gauging my reactions to what she was saying but at the same time she was constantly asking me questions. In the last 5 minutes or so we were having a more honest and open conversation, in particular about her experience being a 17 year old freshman and not being able to be with her friends at the street etc.. As she left, she wanted to hug—writing that sounds strange but it was actually awesome and I think it showed her self confidence and maturity. I wish I had had more time to really get a sense of how Lauren could fit into our organization and look forward to hearing what others have to say.",
        "hall": 3,
        "meeting": 3,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "55fH46Ihxf"
        },
        "objectId": "7OmvGoFqOb",
        "pb": 3,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "Rv1a36NWKZ"
        },
        "updatedAt": "2015-09-30T18:23:29.857Z"
    },
	{
        "createdAt": "2015-10-02T05:40:06.307Z",
        "date": 4,
        "expanded": "I had a really lovely time with Delaney. She is such a sweet, thoughtful, and caring person and talking to her just made me smile loads. We spoke a lot about her time in Bridge Year and how doing that affected the way she sees her time at Princeton--how she feels obligated to work with and for communities in some capacity when she leaves her and not just serve herself. She's Canadian but moved to Mobile, Alabama when she was 8 and has the cutest Southern twang! Coming from Mobile and only knowing people who stay in Alabama their whole lives she really sees Princeton as an incredible opportunity for the taking and seems to have an incredibly positive disposition towards how one might access this place. Still, she seems to be aware of the fucked up parts of Princeton which is dope and really doesn't hold it as this perfect unchanged place. She has a really big heart and a huge willingness to take in new ideas it seems, despite coming from what seems like a Southern conservative background. I think that she would be a great presence in the Hall as she is a great and active listener and speaker and a sweet and caring person all around. My only worry--that she never gave any true evidence for this is just me sensing things--is I don't know how comfortable she would be directly experiencing such an open social environment. This is something I wanna look at for at the rush parties. Would be great for more people to coffee date her!",
        "hall": 5,
        "meeting": 4,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "3EhJDbwCry"
        },
        "objectId": "8t3AI6K3RV",
        "pb": 4,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "QrHVQPlgAt"
        },
        "updatedAt": "2015-10-02T05:40:06.307Z"
    },
	{
        "createdAt": "2015-09-30T03:17:26.698Z",
        "date": 3,
        "expanded": "Enjoyed the conversation, though at times she seemed distracted and a bit aloof, almost as if she didn't have the attention span. IDK it was kinda weird. She was pretty interesting though and she like soccer which was a plus",
        "hall": 3,
        "meeting": 3,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "z2iZWHONTb"
        },
        "objectId": "96pQCkBfll",
        "pb": 3,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "BfK1tJcREr"
        },
        "updatedAt": "2015-09-30T03:17:26.698Z"
    },
	{
        "createdAt": "2015-09-25T00:37:09.228Z",
        "date": 4,
        "expanded": "Ok, i really liked our conversation and thought that time the flew by. He didn't blow me away, but i was taken aback by how fluid our time was and how willing he was to depart from the dreaded small talk, and actually explore some important things. growing up abroad, the insular aspects of Princeton, the time and place for academic pursuits but the necessity for outside school activities. I enjoyed his personality alot, he was open, not awkward, really friendly. all good stuff, the spark may be there!  he seems to be friends with lots of the hall, but i really enjoyed how he did not throw that in my face or act that he was somehow privileged in the rush process because he was connected.",
        "hall": 4,
        "meeting": 4,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "z2iZWHONTb"
        },
        "objectId": "9q9Y9yUPVe",
        "pb": 4,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "AWFFDvfOWa"
        },
        "updatedAt": "2015-09-25T00:37:09.228Z"
    },
	{
        "createdAt": "2015-10-02T16:40:45.211Z",
        "date": 5,
        "expanded": "I LOVE TYLER BOZEMAN. if he does not get in, I will be devastated. I talked to him for a reeeeally long time, about so many different things like what it is like growing up in a conservative southern town as a liberal young black man, among many other things. I honestly could talk to him forever. I enjoyed our conversation so so so much. wow. go him. I know I was his first coffee date, but honestly I will vouch for this kid till i die.",
        "hall": 5,
        "meeting": 5,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "poXrQxuYrn"
        },
        "objectId": "B56u5ol4ui",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "L12PJ13Tfn"
        },
        "updatedAt": "2015-10-02T16:40:45.211Z"
    },
	{
        "createdAt": "2015-10-04T02:54:31.152Z",
        "date": 5,
        "expanded": "I briefly did research on her before the coffee date and realized that she was the one who wrote the Gansa article on Nass. I remember it as one of the most memorable articles I have ever read on any student publication on campus. Despite its length, it is very readable, well-researched and maintains the impartiality even though she was helping Ella Cheng during the campaign.\n\nWe met at Small World Coffee and briefly talked about our backgrounds.\nHer mom is from Japan and her dad is from Australia. She attended UWC, which she has a mixed feeling about. She said it may not for everyone but it was a transformative experience for her.\n\nWhen I mentioned her Nass article, she said she is working on another article on fire safety. I was even more surprised to find out that she is a COS major who finished math prerequisites (MAT 215, 217) and currently taking 300-level COS classes.\n\nShe is also very interested in history, particularly Sino-Japanese relationship and peace-making because she is half-Japanese who grew up in China. I talked about my experience during the summer in Tokyo when I went to the protest at the Japanese Parliament on the day Abe was signing the amendment to the Japanese Constitution. I talked about Korea’s unreasonably strong hostility toward Japan and the fact that revealing my view that Japan should be vindicated would label me almost as a traitor in my home country.\nWe discussed about other organizations like Seeds of Peace and government efforts to relieve the tension in East Asia.\nWe talked over two hours and stopped just because she had to catch a bus at 12PM.\n\nAmong many qualities, humility is the most important quality that I look for in rushees. I met a bunch of smart people during the rush parties but some people had the potential to turn meetings into debate panels. I would happily engage them in precepts but I would not be comfortable in the hall.\n\nThe first impression of her could come across as aloof or even cold for some people. That is because of her composure and it is rare to see people of her age so collated. There’s no question that she’s smart but she never elicited any hints of pretension.\nOverall, it would be a great loss to the Hall if she doesn’t get in. And I am sure that everyone who coffee dated her would agree.",
        "hall": 4,
        "meeting": 5,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "GFVYCdK8mS"
        },
        "objectId": "B6piweVx2X",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "qodZHt0pm4"
        },
        "updatedAt": "2015-10-04T02:54:31.152Z"
    },
	{
        "createdAt": "2015-10-07T14:42:46.216Z",
        "date": 4,
        "expanded": "Agata seems really great. She seems to be pretty proud of her heritage but not afraid to differ from it. She seems to really be adventurous and rather sincere. We talk a lot about the refugee situation because she's polish and discussed what the similarities between post-communist Poland and still communist Cuba are. We had a lot of fun.She seems to really like challenging herself which I respect a lot.",
        "hall": 3,
        "meeting": 3,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "5n6bNbCWtV"
        },
        "objectId": "B7aoRJwGGs",
        "pb": 3,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "2Zpr3HS1m6"
        },
        "updatedAt": "2015-10-07T14:42:46.216Z"
    },
	{
        "createdAt": "2015-10-06T18:23:04.642Z",
        "date": 4,
        "expanded": "The thing that really struck me about Natalia was how comfortable she was taking to me. This might be because I was her third coffee date, or because that's how she is naturally, but either way, this is a very good quality to have as a member of the Hall, and I could definitely see her contributing a lot towards meeting. There were some times during the coffee date when we ran out of things to say, but this definitely could be attributed to the fact that she was exhausted from a day of lecture and I was pretty sick. All in all, I think she'd be a good fit.",
        "hall": 4,
        "meeting": 5,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "3LKOUC17fE"
        },
        "objectId": "BJSfV7XwPz",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "BZHYTI7cPy"
        },
        "updatedAt": "2015-10-06T18:23:04.642Z"
    },
	{
        "createdAt": "2015-10-04T03:11:39.428Z",
        "date": 4,
        "expanded": "She was born in Switzerland and grew up mostly in Zurich.\nBecause her dad (chemical engineer?) travels to theUS often, he sent her to an international school thinking that they might move here. They never did but she ended up as a Swiss who speaks German at home but speaks English with an American accent.\n\nWe were in the same precept last semester (International Relations) but never got to know each other well. She wasn’t contentious and didn’t say much in the precept but at least the ideas she brought up were egalitarian apt to the social democratic country she grew up in (Human Rights Watch sticker on her laptop).\nWe talked about street culture, her parents’ Swiss/Scandinavian influence on her mentality and my experience with interacting with Scandinavian interns in London.\nShe is involved in a lot of volunteering activities on campus.\n\nOne thing I am worried about Olivia is that people might get a wrong idea that if you are dating someone in A's, you might have a better chance of getting in.\nOther than that, I can see her bringing a lot of positive energy to the Hall.",
        "hall": 5,
        "meeting": 4,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "GFVYCdK8mS"
        },
        "objectId": "BZ0dx32Oto",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "aiFB8UBPlp"
        },
        "updatedAt": "2015-10-04T03:11:39.428Z"
    },
	{
        "createdAt": "2015-09-27T01:57:43.867Z",
        "date": 5,
        "expanded": "This was a very positive coffee date. Avanthi and I talked for two and a half hours on topics including the music of Kanye West, why organic chemistry is beautiful and deeply satisfying, Sri Lankan cultural norms, and the role race relations play in modern American public policy. While each of these topics might sound like a potential title of a quirky, intellectual magazine article —think the Atlantic or Mental Floss —what really got me excited about Avanthi wasn't as much the variety of the things she talked about as it was the enthusiasm she spoke with. \n    Another thing I really liked about her was the way she talked about her social life at Princeton. She went to Lawrenceville for high school, and talked a lot about how the cutthroat academics and the status-minded social atmosphere made it hard for her to find close friends there. However, when she came to Princeton, she met a close-knit group of friends who she described as \"grounded and bullshit-free,\" and this has made her past year here really enjoyable. I think that her deep understanding of and appreciation for strong, interpersonal relationships would make her a great fit for the Hall.",
        "hall": 5,
        "meeting": 4,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "3LKOUC17fE"
        },
        "objectId": "BqpZBFB8gW",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "krw0sjctDe"
        },
        "updatedAt": "2015-09-27T01:57:43.867Z"
    },
	{
        "createdAt": "2015-10-02T20:29:01.837Z",
        "date": 5,
        "expanded": "My coffee date with Nico felt so natural and worthwhile. He is creative, kind, and intelligent, and one of the reasons he came to princeton is because of Oge's production of Red!! It's a sign. He opened up not only about his personal interests (directing, performance studies), but also about some of the challenges he has faced - both here and in the past. I really think his participation in A's would be mutually beneficial. It would be a shame for us not to share A's with him!",
        "hall": 5,
        "meeting": 5,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "kSGEshJdTB"
        },
        "objectId": "BqyvoxfDNv",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "zydDj0wlxO"
        },
        "updatedAt": "2015-10-02T20:29:01.837Z"
    },
	{
        "createdAt": "2015-09-30T20:03:47.829Z",
        "date": 5,
        "expanded": "Yes, yes, yes. WIlglory has spunk, self-confidence, and critical-awareness. She does her thing and has plenty of opinions, but she remains lighthearted and accessible. I expect she could bring much needed perspectives to meetings and help us be the sort of community we want to be.",
        "hall": 4,
        "meeting": 5,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "kSGEshJdTB"
        },
        "objectId": "C7wEYfGMGj",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "awMgpjZI4i"
        },
        "updatedAt": "2015-09-30T20:03:47.829Z"
    },
	{
        "createdAt": "2015-10-03T04:51:31.491Z",
        "date": 2,
        "expanded": "This coffee date kind of came out of left field. Apparently Eric just recently joined rush because a friend recommended it, so our coffee date was his first experience with A's in general. I have to say that I'm sure he's a nice person, and I do feel rather guilty about rating him so badly… But I really cannot see him in this group and environment at all. I tried to get to know him and asked a lot of questions, about everything from his family, high school, ideas, passions, studies, friends… They were met with more or less concrete answers, full of broad generalizations that I found difficult to get him to explain. He shifted around a lot in his seat, had trouble making eye contact with me, and I couldn't seem to find any common ground between us. I could go into greater detail about what we talked about, but honestly I don't know if it would help flesh out his personality. After the first five minutes, I had this sinking feeling; I tried to stick with the coffee date and get to know him, but it wasn't exactly fruitful. I would really not feel comfortable having this person in the group, and it's not because he's necessarily a \"bad\" person, or an \"uninteresting\" one… I just don't think it's the right fit.",
        "hall": 3,
        "meeting": 2,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "dKDrhW55r4"
        },
        "objectId": "CHBWYXlVnL",
        "pb": 1,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "ldwFwHzBMr"
        },
        "updatedAt": "2015-10-03T04:51:31.491Z"
    },
	{
        "createdAt": "2015-10-07T13:02:33.260Z",
        "date": 5,
        "expanded": "Caro is a bubbly, lively,  vivacious, incredible little ball of energy. We spoke for an hour and half, and this after I had a game prior, which speaks to her ability to engage in conversation and maintain flow. She was awesome, really, just as willing to transition between a political discourse on the work of Mario Vargas Llosa, to going into detail about the benefits and negatives of growing up in Lima, Peru, to the difficulties and joys of Polo. She plays POLO! How awesome is that! She literally rides around on a horse and tries to smack a little ball with a little mallet and all the while other people are riding around on horse trying to prevent her from smacking that ball with their little mallets. The entire concept is insane! \nShe was so passionate about her academic work it actually took me by surprise. Focusing on Public Health Policy, she has wonderful ideas and an awesome drive that I think she will wield into making an impact on Latin America as a whole. Its such a shame that she is coming to this so late in the game, and we really need to get her meeting more members, because she was, in my opinion, a person who would slot perfectly into what we are, and what we want to be.",
        "hall": 5,
        "meeting": 5,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "z2iZWHONTb"
        },
        "objectId": "D6rSxoJr50",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "s1Fv8LHOaQ"
        },
        "updatedAt": "2015-10-07T13:02:33.260Z"
    },
	{
        "createdAt": "2015-10-08T13:26:46.309Z",
        "date": 4,
        "expanded": "Avanthi was nice, but i never got the sense that she really needed the hall. although i really really liked our conversation and she helped me set up my studio.",
        "hall": 4,
        "meeting": 3,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "poXrQxuYrn"
        },
        "objectId": "DhYDVYB3zm",
        "pb": 4,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "krw0sjctDe"
        },
        "updatedAt": "2015-10-08T13:26:46.309Z"
    },
	{
        "createdAt": "2015-09-29T15:03:42.019Z",
        "date": 4,
        "expanded": "Zan seems like a really fun and easy going guy but that's about it. Our coffee date was really nice, calm and soothing. I think he learned more about me and about the things I like he agrees with more than anything else. I did try consistently to ask and to get to know him on a deeper level which happened on some level but I think he's still trying to figure out what drives him, which is completely understandable, and thus wasn't as adamant about any of the things he cares about. He's a wonderful guy and a pretty good listener but I think he's more of a going a long with the flow and doing agreeable things suggested by others than I know what I want and what I can bring to the table kind of guy. I'm not sure what, new or specific insights or contribution he would bring to meeting. Nevertheless he is both agreeable and very likely to agree to things suggested by others he admires or likes.",
        "hall": 3,
        "meeting": 2,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "5n6bNbCWtV"
        },
        "objectId": "DrN1JAb6Z6",
        "pb": 2,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "psrcYsjgsY"
        },
        "updatedAt": "2015-09-29T15:03:42.019Z"
    },
	{
        "createdAt": "2015-10-04T03:20:50.141Z",
        "date": 4,
        "expanded": "She is very committed to dance performance groups on campus since she is in both BAC and Bhangra.\n\nSince she went to Spain for one of her seminars last year, her major interest became Spanish. Although not a native speaker, she spent her summer in Spain and Bolivia so she is considering Comp Lit major or at least the Spanish certificate. \nBut because her parents who are both doctors and immigrated from India, they still want her to major in hard science or economics. \n\nI liked her as she seemed like a genuine and nice person. Didn't particularly stand out but I am curious what other people saw in her.",
        "hall": 3,
        "meeting": 4,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "GFVYCdK8mS"
        },
        "objectId": "EuTFiRARfb",
        "pb": 4,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "aemfJd4d33"
        },
        "updatedAt": "2015-10-04T03:20:50.141Z"
    },
	{
        "createdAt": "2015-10-06T19:08:08.254Z",
        "date": 4,
        "expanded": "Great Girl! Super nice to talk to and has some really cool and varied experience to add to the hall. The conversation was good, never felt awkward, but also didn't really flow super super well. There was def some pauses that had to be ended in a forced manner. Otherwise though really intriguing girl. 4s all around.",
        "hall": 4,
        "meeting": 4,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "z2iZWHONTb"
        },
        "objectId": "EwGNXyOHoH",
        "pb": 4,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "UN0dC9ciy3"
        },
        "updatedAt": "2015-10-06T19:08:08.254Z"
    },
	{
        "createdAt": "2015-10-09T14:03:59.144Z",
        "date": 3,
        "expanded": "My coffee date with Natalia was enjoyable, though a bit slow at the outset. She was pretty shy at first and it definitely took some time for us to get in a rhythm. We were just talking about how our days had gone; she told me about her linear algebra class that she hated and I had just come from a very cool junior seminar where we visited the art museum conservator’s lab, so I told her about that. She was very inquisitive about art history in general because she doesn’t know very much about the discipline. She asked about why I had chosen to study it and I told her about some of the life-altering classes I had taken that had yanked me out of engineering. She’s studying electrical engineering, so it was interesting to discuss the merits and flaws of the math and physics departments.\n\nWe talked about school for a while and she asked me about my education prior to Princeton, which led to a larger debate about single sex versus coeducational schools, because she had switched to an all-girls school for the last two years of high school. As someone who spent 13 years in an all-girls environment, I’m always interested in hearing peoples’ opinions on this subject, hearing, for example, where they might send their kids to school and why, but it definitely is a conversation I’ve had a lot before and I don’t know that this one shed any new or interesting light on it. In any case, she talked a bit about how difficult it was switching schools and moving to a different city and how it led her to be quite reclusive in the two years before she came to Princeton.\n\nNatalia asked me a lot of questions—a lot, a lot. It was almost as if she was uncomfortable with the silence because she always felt some need to fill the air with words, probably simply because she was nervous. It did, however, mean that we touched on a fairly wide range of topics. Our siblings, our relationships to nature, our favorite restaurants in Princeton, the vis arts program, photography classes here (she’s currently in one I took last year). It was certainly enjoyable to chat about these things, and Natalia was pretty attentive and engaged in the conversation, but it just sort of felt as though we were merely scratching the surface and I would’ve preferred it if we had kept to one subject and really, truly talked about it. And I do know a lot of people require much more time to open up, and I know I’m often times one of those people, but I just wish we had delved more deeply into at least one subject, even if it were more intellectual or philosophical, and not all that personal. We talked for around an hour and I felt like most of it was small talk, so I wish we had more time in some sense, but I had to go do another CD right after. Despite all the random questions, she didn’t have any about A’s and we didn’t really talk about the hall at all so I can’t quite speak to how truly interested and committed I think she might be.",
        "hall": 3,
        "meeting": 3,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "6NmejqZ4eu"
        },
        "objectId": "EwqD88wGAj",
        "pb": 4,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "BZHYTI7cPy"
        },
        "updatedAt": "2015-10-09T14:03:59.144Z"
    },
	{
        "createdAt": "2015-09-30T00:19:27.967Z",
        "date": 5,
        "expanded": "Miranda is quick, enthusiastic, and open. She is both an interesting speaker and a thoughtful listener. She thinks critically about herself and her environment and is looking to grow, which I think is exactly the combination A's seems to be about. I left the coffee date wishing I had heard her say more and excited about spending time with her again - regardless of whether or not she \"gets in\" to A's. I really hope she can join us!",
        "hall": 4,
        "meeting": 5,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "kSGEshJdTB"
        },
        "objectId": "F5dYujascB",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "4u0q4UrYDd"
        },
        "updatedAt": "2015-09-30T00:19:27.967Z"
    },
	{
        "createdAt": "2015-10-05T01:43:45.733Z",
        "date": 5,
        "expanded": "Natalia is a happy and interesting person - she is an engineering major from new zealand who writes for an online magazine and has multicolored hair. She seems to be both independent and great at connecting with people. We had a really natural, casual, long conversation that moved all over the place, and throughout all of it I was happy to be with her. I think we would all enjoy her presence, and I think she could help keep pledging fun for all the sophomores - she seems as though she could be a really unifying personality. In some ways I saw a similarity  between her and Aubree? I would be so excited to get to know her better.",
        "hall": 5,
        "meeting": 4,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "kSGEshJdTB"
        },
        "objectId": "Fw44QlU8uC",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "BZHYTI7cPy"
        },
        "updatedAt": "2015-10-05T01:43:45.733Z"
    },
	{
        "createdAt": "2015-10-07T03:33:40.477Z",
        "date": 5,
        "expanded": "I unfortunately had to meet Talya randomly at 10 PM but she was very understanding and we had a great time walking around campus at night. The conversation started with a bit of a curve ball as we somehow got on the topic of sex trafficking (this was what she worked on during her bridge year). She was very well spoken and open about her ideas; really great to see someone comfortable with just talking about such a topic randomly. Otherwise we talked about our Princeton experiences and what it takes to grow and become an adult here. I enjoyed it a lot and am curious to see what others feel.",
        "hall": 4,
        "meeting": 4,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "kcwZSbfWQv"
        },
        "objectId": "G22YYzkEyS",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "jNdvL54e0X"
        },
        "updatedAt": "2015-10-07T03:33:40.477Z"
    },
	{
        "createdAt": "2015-09-29T18:38:07.854Z",
        "date": 4,
        "expanded": "Fascinating background. Born in Australia, moved to UK, dad was usurped in his company so family was stuck in UK housing projects until his parents could sort out jobs. Parents ended up as teachers and he got a music scholarship to Eaton. Sang professional opera and was part of a group that got a Grammy. Absolutely loves film and tries to write/direct as much as he can in his free time. Studying neuroscience/psych but still pursuing music. Unsure of what Princeton is and friends with a lot of SAE/Zete guys but said their process seemed too much. Was interested in the creativity of As. Would absolutely make an interesting member.",
        "hall": 4,
        "meeting": 5,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "kcwZSbfWQv"
        },
        "objectId": "H00C7DUlUr",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "U4IpoGXw5T"
        },
        "updatedAt": "2015-09-29T18:38:07.854Z"
    },
	{
        "createdAt": "2015-10-09T02:38:25.762Z",
        "date": 4,
        "expanded": "This was a pretty solid coffee date, although not spectacular. Luis was very reflective talking about his experience as a colombian American and the way people often make of the light of the violence that has had a a big affect on colombian society in the past few decades. I really appreciated this openness and I think this would definitely be good in a meeting setting. He also had interesting things to say about bridgeyear and the way it shaped his freshman experience-- not the usual stuff about it being the best year of his life but more about the way he sometimes felt pidgeonholed as a bridgeyear person when he was meeting new people--Once again , this shows how thoughtful he is. We didn't have the best personal chemistry but he seems like a good guy who would enjoy our community and I'd love to hear more about y'all's impressions and thoughts",
        "hall": 4,
        "meeting": 4,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "55fH46Ihxf"
        },
        "objectId": "HxNeg1PRqB",
        "pb": 4,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "YNBtVSupT6"
        },
        "updatedAt": "2015-10-09T02:38:25.762Z"
    },
	{
        "createdAt": "2015-10-01T05:27:23.135Z",
        "date": 1,
        "expanded": "I had some trouble bringing myself to write this report because I had a pretty negative experience on my coffee date with Chris and sort of wanted to put it out of my mind. But here goes…\n\nThings got off to a kind of rocky start. He was like 20 minutes late and then messaged me asking where we were meeting, even though we had agreed several days earlier to meet at small world. I told him I had a table for us there but he asked if we could meet somewhere else because he was further down campus. I went to meet him and it wasn’t such a big deal, just kind of frustrating since he didn’t feel any need to apologize for being late and didn’t explain the sudden desire to change locations. (I had also just bought a coffee to stay…just saying.)\n\nThe conversation was pretty awkward at first, I was asking him about his weekend and about where he’d grown up and he didn’t offer too much information so I had to ask him a bunch of questions and felt as if I was prying. After a while he asked where I was from (I said nyc at first and then he asked where in the city) and then proceeded to talk shit about the upper east side. I don’t know, I get that it’s not the best neighborhood ever and there certainly is a lot to make fun of there, but it didn’t really feel like the light-hearted teasing to which I am accustomed, more like just insulting where I come from. \n\nHe also talked a lot about alcohol and drugs and clubbing—subjects that don’t always make me uncomfortable, but somehow did in this setting, maybe because it was sort of excessive, or because he asked me how much I drink/smoke, which upset me and is just so far from relevant when you’re first getting to know someone. Alcohol really is one of our major concerns as an organization, and we have a good number of members who don’t drink, (all of which makes me so proud to be a part of this group), so I was just considering all that while being put on the spot by Chris’ questions.\n\nI just tried to change the subject and asked him what he was interested in and what some of his favorite classes here have been. He’s a neuroscience major so he told me a bit about that. He asked me what my major was and when I said art history he laughed in my face, without hesitation. I asked what was so funny and he just said something like “oh, no, it’s nothing really…” I decided to just stop talking about myself because I wasn’t up for being insulted more.\n\nHe had a lot of questions about A’s, which I tried to answer to the best of my ability. Many of them seemed to stem from skepticism as opposed to curiosity, and a lot of them were sort of passive aggressive—or just plain aggressive. He asked some of the typical questions, like why I decided to rush, what makes A’s unique, how it’s different than other greek organizations, what we do, etc. etc. He laughed again when I said, in earnest, that A’s had dramatically changed my experience at Princeton for the better, and said that he found that really hard to believe. He also asked things like: “why do you think A’s is so widely disliked on campus? Why do people say the members think they’re intellectually superior and better than everyone else? There’s gotta be some truth to the stigma that you’re all supercilious, pretentious, artsy, holier-than-thou…”\n\nI don’t know, not really sure what else to say. I can’t remember the last time I felt the need to justify myself so much to another person. Beyond being frustrated, I was pretty upset; some of the things he said were quite hurtful, and I felt really shitty about myself for the rest of the day as I replayed the whole interaction in my head. So I know this whole report is very much colored by my emotional response to the conversation, but I just felt pretty deeply uncomfortable and thought I ought to vocalize it. If I didn’t feel safe sharing the simplest pieces of personal information with him, like my major and my hometown, I think a lot of us wouldn’t feel safe sharing our PBs with him.",
        "hall": 2,
        "meeting": 2,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "6NmejqZ4eu"
        },
        "objectId": "IlN7CjIab6",
        "pb": 1,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "GuyA3bzXdB"
        },
        "updatedAt": "2015-10-01T05:27:23.135Z"
    },
	{
        "createdAt": "2015-09-28T20:31:32.952Z",
        "date": 4,
        "expanded": "I chatted with Delaney for about an hour and in that time our conversation went from basic exchange of information and superficial questions to deep, thoughtful inquires about religion and the perception of the self. Delaney is incredibly insightful, not judgemental, and as much as it pains me to use this adjective--nice. We had a great conversation about religion (she is heavily involved in PFA and comes from a cultural and spiritually religious background) and how that affects people's perception of you and your intentions. I am curious to see what her other coffee dates say and how she vibes with them (if she even brings up religion). I think that she would be a fabulous person to give a PB to because she is just so kind and clearly just holds no ill will. But she is deeply committed to her faith and even asked me, what I thought was an interesting question: if A's ever forced me to compromise something about myself. She has so much integrity and I think would be an interesting member of any class because she brings something different.",
        "hall": 4,
        "meeting": 5,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "xt5DyqVpe4"
        },
        "objectId": "IqBPAFNA1Z",
        "pb": 4,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "QrHVQPlgAt"
        },
        "updatedAt": "2015-09-28T20:31:32.952Z"
    },
	{
        "createdAt": "2015-10-08T06:08:29.959Z",
        "date": 4,
        "expanded": "Justinas is a very direct, engaging and interesting character. He's someone that can carry a conversation for hours. He is fun, and has great humor. He has a wealth of enthralling stories about his life, and seems to be very reflective and self aware. I can picture him in meeting with ease; I think he would offer a strong opinions. This intensity may be my only concern, he was very zealous in our chat, but I can also imagine him having a chill side that I didn't get to see in the coffee date setting.\n\nHe also offers a different background to most of our group. His experiences growing up in eastern europe would add another flavor to our diversity of opinion. \n\nWould recommend meeting him to anyone that has the chance, he seems like a good fit.",
        "hall": 5,
        "meeting": 5,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "ASabXj3jqQ"
        },
        "objectId": "J7q6qau4vT",
        "pb": 4,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "Itd5BB6rVX"
        },
        "updatedAt": "2015-10-08T06:08:29.959Z"
    },
	{
        "createdAt": "2015-10-04T09:49:28.786Z",
        "date": 4,
        "expanded": "I enjoyed my coffee date with Rozalie a lot. We didn’t have too much time to chat because we each had commitments, but I really enjoyed talking to her for the time that we did. She’s from Prague, so she told me a lot about that, and about her experience transitioning to boarding school in the U.S. She opened up about initially finding it difficult to make friends in high school and at Princeton, and we talked about the merits/faults of the street and social life here in general.\n\nShe told me a lot about how her life growing up in Prague was very different from the average American childhood, whatever that may be, and how she spent the majority of her time outdoors as a kid and was shocked to meet people in the states who didn’t know how to swim or ride a bike. I was shocked to hear that she had met so many people who didn’t know how to swim or ride a bike. In any event, we got on the topic of embarrassing pool stories because both of our schools mandated weekly swimming classes in lower school. (I told her about how I would immediately turn blue when I got in the pool because I was a scrawny underweight little kid, all of which meant I had to wear a wetsuit for swimming classes and all the girls in my grade started to call me “Blue Bernstein”…she laughed and gave me a little pity “awww”).\n\nAaaanyway we shared scarring locker room/shower stories, one of which occurred during some time she spent in Iceland, so then we started talking about that. She did this really cool volunteer program in a small Icelandic village wherein the sole goal of the organization was to get to know the locals and keep them company. She said that depression and alcoholism were extremely prevalent in the area and their intention was essentially to combat loneliness by just interacting with the people there. This led to a deeper discussion about what factors determine happiness, and how our surroundings, light, and time play enormous roles in determining our mood. It was dark there only 2 hours out of the day, so she was telling me about the experience of losing any normal conception of organized time and we got to talking about how much we take for granted light and the sun setting and their massive effect on us.\n\nAll in all, it was an interesting conversation. I do wish we had had more than 45 minutes to talk because I feel like I didn’t really get a great sense of who she is or how interested she is in A’s. She didn’t really ask me many questions, which I also think was probably a product of the conversation being cut off, and A’s just never really came up. But I definitely enjoyed talking to Rozalie and would want to sit down with her again (I actually did offer because I felt bad we couldn’t talk for longer).",
        "hall": 3,
        "meeting": 4,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "6NmejqZ4eu"
        },
        "objectId": "JNnvqvKhZx",
        "pb": 4,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "XyB84GxZBb"
        },
        "updatedAt": "2015-10-04T09:49:28.786Z"
    },
	{
        "createdAt": "2015-10-08T06:54:41.313Z",
        "date": 4,
        "expanded": "Charlotte is a very sweet girl who's very easy to talk to. A good indication of her potential contribution is what moments I might remember from our almost two hour coffee date, but unfortunately nothing stands out. She is a very busy student (three singing groups), with all the right intentions for joining the hall, meeting new people and expanding her circle, but I think she would be in a little over her head with the time commitment of pledging. \n\nAs with many of my reports, I wish I felt more conviction one way or the other, but I honestly feel very neutral. I hope that others are excited about her for reasons I wasn't exposed to, but I will not have much to contribute.",
        "hall": 3,
        "meeting": 2,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "ASabXj3jqQ"
        },
        "objectId": "JRw6ueVxlp",
        "pb": 4,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "Lnn2oqod5k"
        },
        "updatedAt": "2015-10-08T06:54:41.313Z"
    },
	{
        "createdAt": "2015-10-02T19:07:57.340Z",
        "date": 5,
        "expanded": "Really really sweet guy who at first you think is kinda quiet and awkward but then realize that he just thinks a lot and is introspective which are awesome characteristics. He wants to major in Spanish and switched from chemistry. Loves to cook.",
        "hall": 4,
        "meeting": 4,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "kcwZSbfWQv"
        },
        "objectId": "JXh95ME7Ry",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "5uZh6XmBuJ"
        },
        "updatedAt": "2015-10-02T19:07:57.340Z"
    },
	{
        "createdAt": "2015-10-08T03:02:46.587Z",
        "date": 2,
        "expanded": "Not a good fit at all.",
        "hall": 2,
        "meeting": 2,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "kcwZSbfWQv"
        },
        "objectId": "Jm0yxFoCXy",
        "pb": 2,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "sr4qoZDxfy"
        },
        "updatedAt": "2015-10-08T03:02:46.587Z"
    },
	{
        "createdAt": "2015-10-08T00:13:27.233Z",
        "date": 5,
        "expanded": "Tyler, initially, was sort of quiet at the beginning of our coffee date, but what I mistook as shyness was really just a thoughtful reflection on every question that I asked and every topic we talked about. We talked about identity and place and how the return to home after being at Princeton was both liberating and really difficult. We talked about how you change at Princeton and are able to embrace the diversity of success instead of the people who seem successful in high school. He was so reflective and unafraid to say, \"Hmmm, I'm not sure what I think about this. It's hard to express.\"I felt like he listened to every thing that I said and internalized. I got the vibe that more than anyone else I've coffee dated that the Hall would be a determining factor in his Princeton experience. I think he needs a community like us as much as we need him. His consciousness of issues as well as their complexities and repercussions blew me away. I really enjoyed our hour together, and I'm nervous that he hasn't met enough people, even though he's been really interested in the process. We talked about what it's like to invest time and trust in an organization that you know nothing about. He said that on some level, ignorance is freedom.",
        "hall": 5,
        "meeting": 5,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "pAMJgmz7nJ"
        },
        "objectId": "KQG88kg2vi",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "L12PJ13Tfn"
        },
        "updatedAt": "2015-10-08T00:13:27.233Z"
    },
	{
        "createdAt": "2015-09-29T10:16:09.457Z",
        "date": 3,
        "expanded": "Basic facts: \n- A.B. COS major. \n- She is in the choir (not Princeton Glee).\n- Grew up in Poland and studied for a year in the US during her sophomore year and then went back to finish junior and senior years.\n- Boyfriend goes to Harvard. Met him at a camp for Polish students who want to study abroad in the U.S.\n- Two of her friends are rushing (Alex Reblando and Rosalie)\n\nWe started off by giving each other background information.\nShe is distinctive in that she is one of four Polish students at Princeton. I could see how she could possibly offer some interesting insights during LDs due to her international background but that is probably as far as she could offer.\nShe doesn't seem like a bad person but nothing really stood out to me.",
        "hall": 3,
        "meeting": 2,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "GFVYCdK8mS"
        },
        "objectId": "KQkj66pxDs",
        "pb": 3,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "2Zpr3HS1m6"
        },
        "updatedAt": "2015-09-29T10:16:09.457Z"
    },
	{
        "createdAt": "2015-09-29T18:39:52.196Z",
        "date": 5,
        "expanded": "What a smart kid - the conversation took a ton of twists and turns that I absolutely did not expect but loved every moment of it. He seems like he's one of those people who has so many thought and so much energy towards those ideas that he doesn't quite know how to channel it.  Involved in frisbee and the Nass. Would be a fascinating contributor but I question how dedicated he could be/how much he needs the hall.",
        "hall": 3,
        "meeting": 5,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "kcwZSbfWQv"
        },
        "objectId": "LgUKFmp2LQ",
        "pb": 4,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "FsH7g9FHG9"
        },
        "updatedAt": "2015-09-29T18:39:52.196Z"
    },
	{
        "createdAt": "2015-09-26T18:17:22.526Z",
        "date": 3,
        "expanded": "Talya was very friendly, and I enjoyed our conversation a lot. It sort of felt like I was asking a lot of the questions, and she wouldn't expand on the answer without a little bit of prompting. This was her first coffee date so I can see how people are nervous or unsure about the format, but it did seem like she was waiting for me to make the first move. I also felt like we didn't necessarily move past the superficial questions like what she does on campus and Bridge Year - India. She's very involved in the CJL as well as lots of tutoring/mentoring/social justice work, which she seemed really passionate about. We talked briefly about social justice on Princeton's campus. I think that she has more potential than maybe she let on in our interview, and I hope she feels more comfortable in her second coffee date.",
        "hall": 4,
        "meeting": 4,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "pAMJgmz7nJ"
        },
        "objectId": "LuIN29RjNV",
        "pb": 4,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "jNdvL54e0X"
        },
        "updatedAt": "2015-09-26T18:17:22.526Z"
    },
	{
        "createdAt": "2015-09-29T03:49:57.614Z",
        "date": 4,
        "expanded": "Really fucking awesome. Interesting, dynamic conversation, interested in As but didn't get the sense it was for social climbing. Loved the evening.",
        "hall": 5,
        "meeting": 5,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "kcwZSbfWQv"
        },
        "objectId": "N5bhCyMm4g",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "Acw94Mc4T5"
        },
        "updatedAt": "2015-09-29T03:49:57.614Z"
    },
	{
        "createdAt": "2015-10-04T22:49:09.063Z",
        "date": 5,
        "expanded": "My coffee date with Luis was great—he was just incredibly positive and charismatic and welcoming all throughout. We initially had some trouble finding a mutually convenient time and I had to cancel once because I was vomiting my brains out nbd but he was very understanding and gracious and seemed really excited to have the opportunity to get to know me, which was quite a pleasant surprise!\n\nHe lived in Colombia until he was 4 years old and we talked for a while about his Latino roots and his family there. He’s from the salsa dancing capital of the world apparently, and he loves to dance—he’s also in Mas Flow. As he was telling me about his love of Latino culture, about how he’s grown up learning about the nuances and sensualities of dance, cultivating his own rhythm and style over the course of his life in the various settings he’s been in, I couldn’t help but think that he could offer a really fascinating LD about all these things. It was clear from the way he spoke about it that dance has played a really important role in his life, even though he’s spent most of his time in Jersey, and he talked about his heritage in a way that was really compelling and captivating.\n\nOne thing that really stuck out to me was Luis’ ability to make and maintain eye contact. I complimented him about it and we talked about eye contact for a little while, and about how it’s surprising the number of people we encounter here who seem incapable of wholly focusing on the person in front of them and absorbing themselves in conversation for the sake of conversation. He was incredibly attentive, asked me a whole lot of questions and remembered every detail of my responses. And yet it really didn’t feel like an interview or q\u0026a; it felt as though he was genuinely interested in finding out more about me.\n\nWe talked a bit about school, he told me about his transition from the chem to the cos department, and I told him about mine from orfe to art history. We talked about the math and physics departments, because he’s currently taking those prereqs, about linear algebra, 3D printing, all that jazz, and all of this segued into a discussion about the various different types of intelligence, intellectual versus intuitive, social versus analytical, street-smart versus book-smart. I told him about my seesaw theory of intelligence—that social and traditional, bookish intelligence are inversely proportional, and the higher one is, the lower the other tends to be—and Luis had a really interesting response, trying to understand why, for example, preceptors in the math department seem to struggle to wrap their minds around the notion that people can’t easily grasp concepts that come so naturally to them. Yeah, I don’t know, it was just a really fascinating conversation and he had a lot of interesting opinions to bring to the table.\n\nHe asked a lot of questions about the hall and seemed genuinely interested in understanding what we’re all about. I explained A’s as best I could without giving anything major away and he was really satisfied with my somewhat vague answers and very enticed by the prospect of simply talking to people in an intimate environment with the goal of getting to know each other better and seeing the world from different points of view. He said he’s been looking for something like that at Princeton and has felt it lacking in his life here thus far. Overall I think Luis would fit in quite well in the group and would offer a really interesting perspective on a lot of topics. He seems very comfortable in his skin, and quite honestly made me feel pretty comfortable in mine while talking to him.",
        "hall": 4,
        "meeting": 5,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "6NmejqZ4eu"
        },
        "objectId": "N74NukXKe9",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "YNBtVSupT6"
        },
        "updatedAt": "2015-10-04T22:49:09.063Z"
    },
	{
        "createdAt": "2015-09-26T18:36:24.744Z",
        "date": 4,
        "expanded": "Ugonna was soft-spoken and seemed shy for the first couple of minutes. She even told me she was more introverted than her friends, but she came out of her shell, and we had a great conversation. From Brooklyn, she talked about her family and sharing a birthday with her mom. She described an incredibly admirable approach to Princeton academics and fulfillment through a love of learning. She also joined theater in college - something she never did in high school - something that doesn't happen that often here. She decided to audition for a play after having been moved by the film version of it. I think her contribution towards LDs would be astoundingly profound. I connected with her intensity around friends, her classes, her family. She would bring a gentle and reflective diversity to the group.",
        "hall": 4,
        "meeting": 5,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "pAMJgmz7nJ"
        },
        "objectId": "N8xd8BEqKO",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "f9p9mh6aYe"
        },
        "updatedAt": "2015-09-26T18:36:24.744Z"
    },
	{
        "createdAt": "2015-10-07T21:16:49.190Z",
        "date": 5,
        "expanded": "I am sad that Tobi has joined the rush process so late because I really think she would have benefitted from meet more members. Tobi is a fabulous girl--someone who you can tell is silently solid but also incredibly warm and understanding. When I think about Tobi and her relationship to the Hall,  I just imagine her being a member. For many other people I’ve coffee dated I could see them being a member under the condition of a specific kind of class. Not with Tobi. I think that she would be an excellent member of the As class for several reasons. One, like many people, Tobi is intelligent and I can see her giving interesting LDs concerning her race, growing up in Boston and I also think that As could help her come out of her shell and give her the confidence to be honest with herself and the people around her. I also think that As could also teach Tobi many things. In the same way that As gave me the ability to be a little more self-assured and a little more comfortable in my own skin, I think the organization could really do that for. I think often we think about what people can do for this organization in terms of cool factor, intelligence, and etc, but I also think that we need people like Tobi who did not question the secrecy factor and was merely attracted to rushing because she thought it would be a cool way to find a community she was lacking at Princeton. Not being the most outspoken or obviously liked individual, I think that it will be easy to miss Tobi but I also think that if we wanted to we could really be giving someone a great opportunity to be a little more of themselves.",
        "hall": 5,
        "meeting": 5,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "xt5DyqVpe4"
        },
        "objectId": "NIdtTKOVI7",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "Xoofwx7BUj"
        },
        "updatedAt": "2015-10-07T21:16:49.190Z"
    },
	{
        "createdAt": "2015-10-09T12:11:26.740Z",
        "date": 4,
        "expanded": ".",
        "hall": 5,
        "meeting": 4,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "GFVYCdK8mS"
        },
        "objectId": "NMib2i8mck",
        "pb": 4,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "5uZh6XmBuJ"
        },
        "updatedAt": "2015-10-09T12:11:26.740Z"
    },
	{
        "createdAt": "2015-10-03T21:00:53.230Z",
        "date": 3,
        "expanded": "Chance would bring an important perspective to have at the hall--a double varsity athlete and potential econ major. Chance was very guarded during our conversation, and seemed nervous. When I asked him his thoughts about a book or a film, he tended to shy away from giving a real answer and asked me what I thought instead. He did open up a little bit when talking about film criticism and Drake, but even then his answers seemed a little stilted. He seemed to have done his homework and ask me about things I had written a long time ago, which was flattering but I was also a little taken aback.",
        "hall": 3,
        "meeting": 3,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "kldlMuEeNt"
        },
        "objectId": "NPbBTqrz0k",
        "pb": 3,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "5Y5mC3kqrq"
        },
        "updatedAt": "2015-10-03T21:00:53.230Z"
    },
	{
        "createdAt": "2015-10-04T02:55:19.381Z",
        "date": 2,
        "expanded": "I felt my energy was being drained out throughout the whole conversation.\nShe was rushing a sorority with her roommates (with whom she wants to bicker T.I. with) but stopped because she failed to make any new connection at their parties.\nShe was name-dropping philosophers and books but when I asked her thoughts, she didn’t seem to have any...",
        "hall": 3,
        "meeting": 1,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "GFVYCdK8mS"
        },
        "objectId": "NsTkvRNJKo",
        "pb": 1,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "RLETfJcJ0C"
        },
        "updatedAt": "2015-10-04T02:55:19.381Z"
    },
	{
        "createdAt": "2015-10-01T17:00:50.645Z",
        "date": 5,
        "expanded": "I thought beth was one of the nicest sweetest people i have met. I really enjoyed talking with her about what it was like growing up in Kansas, her interests in art history, and her tailoring skills (i am not joking). She was so so so so so sweet. She is also in the TGs and loves dogs and poetry.",
        "hall": 5,
        "meeting": 4,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "poXrQxuYrn"
        },
        "objectId": "Ok5jUBW9x8",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "A6U5bDZZxL"
        },
        "updatedAt": "2015-10-01T17:00:50.645Z"
    },
	{
        "createdAt": "2015-10-01T04:34:49.184Z",
        "date": 5,
        "expanded": "Rozalie (it's spelled with a \"z\"!) is super interesting and very easy to talk to. She's incredibly passionate about environmental issues, particularly those related to food. She's highly active in campus environmental activism, such as with Greening Dining -- she explained to me that the new compost system in the residential colleges (it now includes napkins), was only won after a year of their group campaigning for it. She also proposed a Freshman Seminar about food sustainability, which will be offered next year, and she's going to be a preceptor/intern in it. If I remember correctly it'll be co-taught by an environmental scientist and a chef, and it was hard to get approved because they'll be eating a lot of local/sustainable food, which is expensive. Now she's campaigning to get it offered every year as a course in the Environmental Studies department (which is her certificate).\nShe's from Prague and moved to the U.S. for the second half of high school. We happen to have seen the same terrible production of Carmen in Prague, and she explained that the director is famous for making awful Czech comedy films. Rozalie's uncle was apparently the artistic director of the theater that Václav Havel had most of his work done at (Havel was a playwright who later became the President of the Czech Republic).\nShe sings in Glee Club, and she also plays the cello. She saw the show Hamilton recently, and said that despite its hip-hop score, she noticed that the arrangements make oddly frequent use of the cello.\nIn addition to doing music, she has a job in the Vis Arts department.\nShe also speaks 5 languages: Czech, English, French, Spanish, and a little German.",
        "hall": 5,
        "meeting": 5,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "5CRAKWB3Nr"
        },
        "objectId": "PIPkO6TpQC",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "XyB84GxZBb"
        },
        "updatedAt": "2015-10-01T04:34:49.184Z"
    },
	{
        "createdAt": "2015-09-25T00:48:31.187Z",
        "date": 5,
        "expanded": "Ashwin was a fabulous coffee date and I think he should get another one. At first, he seemed a little awkward but I think it was because I was flustered and he is actually chill. We talked about his interest in music, his band, his family, and the fact that he almost transferred his freshman year. We shared stories about growing up in an immigrant family and the pressures associated with it. One thing that really struck me about Ashwin is that he is an excellent listener. He was very attentive and his final question was one of the more thoughtful that I have heard it in a long time. He asked me \"what is one reoccurring thought that you have been having?\" This then lead to a conversation about music and how sometimes even the strike of a chord can remind you of a person. I could really see him participating in LD because he has such an interesting perspective on the simplest of topics--like music.",
        "hall": 4,
        "meeting": 4,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "xt5DyqVpe4"
        },
        "objectId": "PdjseUkKg6",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "chihoWvNsW"
        },
        "updatedAt": "2015-09-25T00:48:31.187Z"
    },
	{
        "createdAt": "2015-10-03T20:09:43.238Z",
        "date": 5,
        "expanded": "Evan was a very thoughtful guy who had a lot of interesting ideas about open-mindedness and the cross-section between \"different\" cultures and religions. His view of the world was extremely interesting because he comes from a military family and has had opportunities to live in parts of the world where he constantly was exposed to ways of life that didn't reflect his home situation. I feel like this process of discovering and challenging any conceived notions about life has really trained him to be an open-minded person who's adept at carrying conversation and implicating himself into the conversation in a thoughtful and caring way. I really liked my coffee date with this guy. He also seems like a very grounded guy, which is why I believe he would be on top of his stuff in terms of being committed to the hall.",
        "hall": 4,
        "meeting": 4,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "SmBf5on1pc"
        },
        "objectId": "PiCeKfsvTD",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "GnSQLHo5ts"
        },
        "updatedAt": "2015-10-03T20:09:43.238Z"
    },
	{
        "createdAt": "2015-09-24T02:37:05.091Z",
        "date": 5,
        "expanded": "Becca seems like a lovely girl – she's quite easy to talk to and I enjoyed our conversation.  We talked about where she grew up, her previous schooling, bridge year experience, interests, past summer activities, family, etc.  She seems to be mostly interested in social work-type activities (did a PICS internship, does a lot of volunteering with kids). She also has an interest in design and psychology. \n\nI felt that she was good at explaining herself and her experiences, but that when the conversation took a more discursive turn, she didn't contribute as much. I felt that, to that end, our conversation (when it was more like a conversation and less like an interview) was not entirely generative. It's possible that our conversation was altered by the fact that it was a coffee date, so maybe she was more reluctant to engage in anything I mentioned or brought up (thinking it should be more one-sided).  This isn't to say that the conversation wasn't fluid – as I said, I enjoyed talking to her very much!!  I just feel that a large part of A's is about the exchange of ideas on a peer-to-peer level, about learning from each other and about our different experiences and interpretations of the world.  While she was able to articulate her memories and her feelings, it was difficult for me to discern whether she thought more deeply and/or questioned them. Many times, she would voice concerns – about Princeton being a bubble of isolation from the world, of whether or not volunteer work abroad is actually helpful – but would stop short of addressing them in any way.  Again, this could be a situational factor (the somewhat contrived nature of coffee dates, etc.), but I just felt that, overall, Becca may not be the absolute best fit for this.",
        "hall": 5,
        "meeting": 2,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "dKDrhW55r4"
        },
        "objectId": "Qcy89SkxoX",
        "pb": 3,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "sSeMRpIOe1"
        },
        "updatedAt": "2015-09-24T02:37:05.091Z"
    },
	{
        "createdAt": "2015-10-08T02:16:57.988Z",
        "date": 4,
        "expanded": "peppy person, spoke for a while like music. would probably fit in socially. also had a philosophical discussion, which gave me some doubts about meeting contribution, but idk. wasn't especially impressed, but could see her enjoying the hall.",
        "hall": 3,
        "meeting": 3,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "kldlMuEeNt"
        },
        "objectId": "QysyuZex45",
        "pb": 3,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "PpB1kGxU6V"
        },
        "updatedAt": "2015-10-08T02:16:57.988Z"
    },
	{
        "createdAt": "2015-10-08T06:28:22.901Z",
        "date": 4,
        "expanded": "Allison is refreshingly confident, she talks very directly without nervous pauses, and with a lot of jokes. She seems to be extremely busy, taking 6 classes and working in theater and writing for triangle. She seemed very open minded about the process of rushing, and didn't come off as if she was trying to impress.  In some ways she reminds me of Claire, one of the only other girls at Princeton I would describe as very confident and comical. \n\nFrom my understanding she is someone with connections to a lot of members within As, who will have a better understanding of her potential fit with the group than I will. The reason I didn't rate her as highly as my description above is because those are my very blind impressions, from a short chat. She also came off as a bit self centered. I fear that because she's so busy she won't commit to the hall the way we would hope.",
        "hall": 3,
        "meeting": 4,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "ASabXj3jqQ"
        },
        "objectId": "R8YlszsIWq",
        "pb": 3,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "4ztTSRITYT"
        },
        "updatedAt": "2015-10-08T06:28:22.901Z"
    },
	{
        "createdAt": "2015-09-25T21:58:30.356Z",
        "date": 4,
        "expanded": "As a whole, what struck me was Kabbas's confidence during our conversation. In my other coffee dates, there were sometimes hesitations, little awkward moments, or things that pointed to the fact that we were meeting under somewhat contrived circumstances; Kabbas began talking freely as soon as we met, and after awhile we were just naturally discussing our classes, lives, ideas, etc. We talked a lot about politics, power, and journalism; based on what he brought up during our talk, these seem to be his main interests (as well as cooking - he makes his own bread apparently!). I learned a bit about his background – he grew up in the states (NJ I think) and moved to Pakistan for about seven years before returning. He was reluctant to talk much about his family, it seems like he's not exactly close with them; he comes from a large family full of \"soap opera-like drama\" and tends to avoid deeper connections with them in favor of meaningful friendships at school. \n\nTo me, he seems like a strongly opinionated, political force. He talked a lot about his investigative journalism class, which he seems to be quite passionate about.  I liked hearing about what he took away from his classes, or the different stories he was hoping to write/research. For most of the coffee date, we just discussed ideas, like the disconnect between outward appearance/inner personality, general political theory, the republican/democratic debates, etc. It was a lot of fun! I find that he's an intellectually curious, interesting person. \n\nThere were some times where I would attempt to bring something up and he would keep talking over me, or somewhat ignore my opinions (chalk it up to nervousness/eagerness to share his ideas). Sometimes I would ask him questions about his life, friends, or take on Princeton in general, and he would laugh at me (in confusion? As a kind of \"why are you asking this?\" kind of way, I suppose). He describes himself as an \"anti-establishment\" kind of person, and professed that he was a bit surprised at himself for rushing a fraternity-like organization. \n\nI found our conversation to be stimulating and enjoyable, but I could also tell that he was deliberating what to tell me regarding his family, friendships, and past in general. I got the sense that he was picking and choosing what to say (which is to be expected, of course). I rated him highly on most accounts except for the PB rating.  The reason for this low rating is that although I really liked our conversation, I didn't exactly feel \"safe\" with him. I felt some judgment for my questions, or a reluctance on his part to consider other opinions or viewpoints. I understand that this is a very subjective account, which is why I hesitate to write this kind of thing out. When I think about the people in the hall, I mostly remember the way I feel around them – for the majority of the time, I feel safe, loved, and happy.  From Kabbas, sometimes I got some negative/jaded vibes that made me reluctant to open up to him about certain things, or ask him questions/share ideas without reservation, which I believe is an integral part of my experience in A's. \n\n(Sam, sorry this is so long)",
        "hall": 4,
        "meeting": 5,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "dKDrhW55r4"
        },
        "objectId": "RYcWR2T07y",
        "pb": 2,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "Neh3UDlKRg"
        },
        "updatedAt": "2015-09-25T21:58:30.356Z"
    },
	{
        "createdAt": "2015-09-26T02:17:38.817Z",
        "date": 4,
        "expanded": "I enjoyed the hour and a half conversation that we had, and thought that Madeleine was a very nice person. Thats about it. Very nice. \n\nOk to be honest there is a lot more to this girl than that. she has travelled alot, born and raised abroad, she could totally bring an interesting perspective into the hall. She did not however, seem all that committed to rushing, she mentioned that she was looking into sororities as well. However, she has written some cool shit and been involved with nat geo, and that' s cool.",
        "hall": 2,
        "meeting": 3,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "z2iZWHONTb"
        },
        "objectId": "SPpg1Vs6f4",
        "pb": 3,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "KRoi3p77uy"
        },
        "updatedAt": "2015-09-26T02:17:38.817Z"
    },
	{
        "createdAt": "2015-09-30T20:34:12.877Z",
        "date": 3,
        "expanded": "I was kind of tired to be honest but it was a boring coffee date. She seems like a really nice girl. She's super polite and seems fairly mature. I just wasn't all that wowed. I don't know how much she would bring to meeting or to a pledge class but she seems like a great person. I do not recommend adding her to a pledge class though, sadly.",
        "hall": 5,
        "meeting": 2,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "5n6bNbCWtV"
        },
        "objectId": "Suzu04Rk8J",
        "pb": 3,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "aemfJd4d33"
        },
        "updatedAt": "2015-09-30T20:34:12.877Z"
    },
	{
        "createdAt": "2015-09-30T03:56:00.644Z",
        "date": 4,
        "expanded": "Olivia was SO open-minded, so eager to learn from my perspective \u0026 experiences, so kind and overall just a really refreshing person to talk to. International student and writer who loves using her journalism as a platform to meet different people and expand on her experiences (i.e. she was so excited she got to cover the Wa opening, just because of the new people and situations she was put in). I feel like her excitement would be really good for the hall - I can imagine her being extremely grateful and enthusiastic to do different tasks and learn from us. After buying coffee we went for a walk, during which I ran into a friend (who I met through PFA), and she asked how I met them. After telling her, she politely asked to learn about my faith and overall life story of why I believe what I believe, what my doubts are, etc. I thought it was cool that she asked because I think it's easy to shy away from faith-related conversations at Princeton sometimes. She explained her atheism to me, and it in no way was a defensive or offensive conversation - we were both totally respectful of each other's views, and I think we both learned a bit from what either of us had shared. Not everyone can easily talk with someone who shares different world views from them, but she knowingly initiated that kind of dialogue with poise. Would love to get to know her more! Based what she described to be her circle of tight friends, it sounds like she's good at connecting with many different kinds of personalities, which is a huge plus. 2 thumbs way up!",
        "hall": 5,
        "meeting": 4,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "9tRoCjmjnJ"
        },
        "objectId": "TYsnuZ9PkW",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "aiFB8UBPlp"
        },
        "updatedAt": "2015-09-30T03:56:00.644Z"
    },
	{
        "createdAt": "2015-10-04T21:50:00.870Z",
        "date": 2,
        "expanded": "Kabbas was not that interesting or engaging. I felt like I was totally driving the conversation and it didn't see like he was that interested in talking to me in the first place. He's taking 6 classes this semester and doesn't seem to do much else on campus. I don't think he is a good fit for the Hall. He didn't seem to want to engage on anything more than superficially, even though I think he probably could. He seemed bored during our coffee date. :(",
        "hall": 2,
        "meeting": 2,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "pAMJgmz7nJ"
        },
        "objectId": "U54oNSPJ1a",
        "pb": 2,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "Neh3UDlKRg"
        },
        "updatedAt": "2015-10-04T21:50:00.870Z"
    },
	{
        "createdAt": "2015-10-09T12:11:40.598Z",
        "date": 4,
        "expanded": ".",
        "hall": 4,
        "meeting": 4,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "GFVYCdK8mS"
        },
        "objectId": "U9ppAIuqct",
        "pb": 3,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "5Y5mC3kqrq"
        },
        "updatedAt": "2015-10-09T12:11:40.598Z"
    },
	{
        "createdAt": "2015-09-26T02:45:39.878Z",
        "date": 4,
        "expanded": "What I like about Charlotte is her love of music and singing.  It seems that she's been passionate about singing ever since she was young, and grew up in a family that encouraged her exploration/pursuit of the arts. \nWe had a really interesting conversation about religion and Mormonism, in particular (her father grew up Mormon and later denounced it). She grew up in D.C. and has lived there ever since; she's interested academically in psychology and neuropsychology, and did an internship where she got to explore both the clinical and research aspects of the field. She mentioned that she's particularly sensitive to developmental problems in children, due to her autistic sister. I liked talking to her about different types of music, psychological concepts, and the visceral feelings we get from experiencing certain art forms. \n\nI really enjoyed the moments when she loosened up a bit and laughed or smiled. To me, she seemed to be a rather reserved person, and rarely expressed emotion when she spoke. When I first met her, she was quite nervous and spoke very softly; even when I could feel that our conversation was becoming more fluid and natural, she would still have her arms mostly crossed and shift from side to side. I feel as though this part of her - this characteristic - has roots beyond simple nervousness. She even addressed the fact that she is (and is known by her friends to be) less emotionally responsive. Because of this, I worry that she wouldn't be able to open up to us in a group setting, or contribute her thoughts. I felt like I was trying my best to make her feel comfortable and safe, but it was still difficult for us to reach a point where conversation was both fruitful and relaxed.",
        "hall": 5,
        "meeting": 3,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "dKDrhW55r4"
        },
        "objectId": "UT3vf6yP8n",
        "pb": 3,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "Lnn2oqod5k"
        },
        "updatedAt": "2015-09-26T02:45:39.878Z"
    },
	{
        "createdAt": "2015-10-04T21:39:59.151Z",
        "date": 4,
        "expanded": "I am not sure how to categorize Dipo because he is such an odd guy. Not in the way that is bad, but in a way that you want to keep talking to him so that you can figure it out. In a way that makes you understand that his philosophical notions, awkward laughs, and tangents are not out of pretentiousness but earnestness. He is the kind of guy that lives in his own head and I think that he would be a fascinating addition to the hall. To be honest, I think it will depend on the class make up but I really enjoyed my conversation with him because of how deep he thought and how polite he was. His reason for rushing As was because he liked meeting and talking to new people and he is very self aware about his shortcomings, oddness, and general way of being. I enjoyed our conversation and I would love to hear what others have to say because he would be a good addition to the Hall.",
        "hall": 4,
        "meeting": 5,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "xt5DyqVpe4"
        },
        "objectId": "UUhAyJxI2I",
        "pb": 4,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "80YfRKQRV0"
        },
        "updatedAt": "2015-10-04T21:39:59.151Z"
    },
	{
        "createdAt": "2015-10-06T21:29:02.308Z",
        "date": 4,
        "expanded": "BRUH! Sebastian is honestly a really cool kid. I know that doesn't matter so much but he's honestly one really cool guy. I really really enjoyed our coffee date. My only reservation is that I didn't really speak much at all. He never asked me questions and thus doesn't really know much more about me than he did before we went on our coffee date. Looking back I think it was because he was kind of nervous about the whole thing and wanted to make a good impression. I don't think he meant to be disrespectful or dismissive at all. Anyway. Sebastian knows a lot a lot about the things he likes which I really respect. We talked about so much. We talked about his opera singing but because I know nothing about opera we quickly moved on and jabbed about drumb \u0026 bass , grime, garage , drake and skepta for hours. You might think that it was really base and basic and lame but no! These conversations encompassed us talking about riots, the difference in race relations between london and america, how much we both dislike the princeton social scene and most of the available extra-curriculars here. He said things like, Yeah as a DJ, one of the things I think about a lot is how sexual assualt starts on the dance floors at the eating clubs! Who would've thought that would come out of his mouth. We talk about police on black violence, we discussed the history of cultural assimilation, appropriation and mixing of Jamaicans in London... We talked about having fun sober and the joys of going out to have only one or two good drinks over dinner with friends... We talked about the value of individual fashion vs. conforming through clothing. We discussed one of his screenplays that sounds amazing! I'm curious to hear how other people's encounters went with him. I just really enjoyed talking to him because of our love for music especially rap, grime and d\u0026B ESPECIALLY because our love translates in our obsession, love and appreciation with talking about race, history, politics and culture through these music genres. He seems like a really open minded, cultured, fun, complex, nice guy. I especially like that we got to the subjects of race, sexual assault, colonialism on our first meeting even though he's a white male and I am a black woman.  I honestly had a great time.",
        "hall": 4,
        "meeting": 3,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "5n6bNbCWtV"
        },
        "objectId": "UsvkoS7Va9",
        "pb": 4,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "U4IpoGXw5T"
        },
        "updatedAt": "2015-10-06T21:29:02.308Z"
    },
	{
        "createdAt": "2015-09-27T00:09:57.866Z",
        "date": 4,
        "expanded": "Anna is an incredibly kind and sweet girl. I spoke to her very briefly at the second rush party where she seemed quite quiet and reserved but I am so glad I got to talk to her properly over a coffee date. The conversation was natural from the get go and I never really found myself thinking up topics that might help me get a sense of how she would fit in with us etc. I loved hearing about her experience in Nepal during her gap year and her thoughts on different methods of meditating (i have just started meditating so had lots of questions). She was very reflective about her experiences transitioning from a childhood in small town colorado to Lawrenceville and then to Princeton after taking a gap year. I think Anna would be very committed to the hall-- she said she has somewhat of a social group (she has been brought into the bridge year community by a close friend) but is still trying to find a bit more than that. I think the way she spoke about her experiences and diligently asked me about mine would come across well in meetings. I also found myself opening up to her in more ways than I have in past coffee dates and she seems like exactly the kind of sophomore I would feel comfortable giving my PB to. I am curious to hear what others have to say about Anna because I would be delighted to see her face on the piano.",
        "hall": 5,
        "meeting": 4,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "55fH46Ihxf"
        },
        "objectId": "VNpicM8GDs",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "UN0dC9ciy3"
        },
        "updatedAt": "2015-09-27T00:09:57.866Z"
    },
	{
        "createdAt": "2015-10-03T01:08:41.949Z",
        "date": 5,
        "expanded": "I enjoyed this coffee date the most out of the four I've been on so far. Alex is really nice and our coffee date was more of a real conversation than my other ones -- it never felt like she was just talking about herself or bragging. She's on the rugby team! She did a lot of other sports in high school, but she just took up rugby in college. She was pretty anxious about their game against Harvard on Saturday. We talked about religion, because her dad works for Christian Union, and she was saying that they blatantly try to have/help Ivy-League kids become Christian leaders in society, which she finds a little creepy. She also informed me that PFA is not nearly as student-run as they like to make it seem -- a lot of the control comes from the national level. She said her grandma didn't raise any of her children with a religion, and then when they were 18 she told them to go out and choose one, and we talked about how Quakerism seems like a cool one to choose. She really likes Jesse Eisenberg and saw one of the plays he wrote, although she hasn't seen \"The End of the Tour\" yet (I told her she must because it's a phenomenal film). We each told the stories of our parents meeting each other, which is an example of this feeling like a conversation rather than a weird interview. She's a history major with an ENV certificate, and she says she really wants to do the program in Cuba this spring.",
        "hall": 5,
        "meeting": 5,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "5CRAKWB3Nr"
        },
        "objectId": "WJKRzq9HZ2",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "Acw94Mc4T5"
        },
        "updatedAt": "2015-10-03T01:08:41.949Z"
    },
	{
        "createdAt": "2015-09-30T14:10:05.197Z",
        "date": 3,
        "expanded": "Alex was very friendly and made easy conversation. She seemed to be engaged in her classes and likes to party. However, it was the content of her conversations that was very off-putting. She told me about how she experiments with fasting and the ice cream we got (at 9pm) was her first food - also she doesn't do late night/drunk pizza  because of the calories....we would not be friends. She couldn't give me any sort of good answer about why she chose Plato in Berlin for the summer and was unable to be introspective on any of the topics I teed up for her. Then we got to eating clubs: an incredibly tacky, weird conversation. Maybe she just had an off night, but I was not impressed by her depth of interaction.",
        "hall": 2,
        "meeting": 2,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "pAMJgmz7nJ"
        },
        "objectId": "WRiERMD6wk",
        "pb": 1,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "PpB1kGxU6V"
        },
        "updatedAt": "2015-09-30T14:10:05.197Z"
    },
	{
        "createdAt": "2015-10-07T00:29:54.606Z",
        "date": 4,
        "expanded": "She was fine. Nothing spectacular...",
        "hall": 4,
        "meeting": 3,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "poXrQxuYrn"
        },
        "objectId": "WU2Co4TcXH",
        "pb": 4,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "DhbcvjSVjN"
        },
        "updatedAt": "2015-10-07T00:29:54.606Z"
    },
	{
        "createdAt": "2015-09-26T02:27:48.888Z",
        "date": 5,
        "expanded": "Holy hell i loved this girl. \nreally glowing conversation. SHE IS SO CHILL LIKE HOLY SHIT SO CHILL! i felt really comfortable talking to her and really really loved her vibe. Did i mention she is chill as hell! Conversation was expansive, deep, and never awkward in the slightest. We ranged from high school and the change of self experienced with each year at college, to sports (YAY sports!), to her time as an Australian citizen, raised in hong kong, went to UWC in Wales, and traveled everywhere in between. She could tell me that the turkish coffee she ordered was pretty decent compared to actual turkish coffee in Turkey, and that was cool. She was a breath of fresh air honestly, and I really enjoyed this coffee date.",
        "hall": 5,
        "meeting": 5,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "z2iZWHONTb"
        },
        "objectId": "WbvoSjuP4v",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "qodZHt0pm4"
        },
        "updatedAt": "2015-09-26T02:27:48.888Z"
    },
	{
        "createdAt": "2015-10-06T02:35:16.341Z",
        "date": 3,
        "expanded": "Erin talks really slowly. Our conversation was not really inspiring in any way, but maybe both of us were just tired. I would giver her a solid \"meh\".",
        "hall": 4,
        "meeting": 3,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "poXrQxuYrn"
        },
        "objectId": "WtA7tp9B6M",
        "pb": 4,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "nJb05s5Tdt"
        },
        "updatedAt": "2015-10-06T02:35:16.341Z"
    },
	{
        "createdAt": "2015-09-29T10:28:54.817Z",
        "date": 5,
        "expanded": "Basic facts: \n- Born in London\n- Mother is from Ghana and father from Sierra Leone. Some of his family members are still back in both London and Sierra Leone.\n- Interested in studying politics\n- In Tigertones and BAC. Plays various sports\n- His girlfriend goes to Princeton. Been dating for a year.\n\nI really want him in the hall. \nAlthough he is obviously a very talented and versatile person, he came across as a genuine and humble person which really distinguished himself from other try-hards.\nBeginning with talking about how we can't understand people who think Princeton is a boring place, we agreed that if you purposefully seek sources of joy on campus, this is the best place you can be. He is a dynamic and unexhausted person who continuously seeks such sources. Although his not in a varsity team, he moved from one kind of sports to another. He was in BAC until he hurt his leg playing soccer and joined Tigertones.\n\nWe also talked a lot about how we cannot postpone our current happiness (e.g. spend your 20s at a investment bank to retire early) and somehow we need to break away from this chain of continuous competition.\n\nMy only worry is that since he is involved with so many things on campus, he might not be able to commit to the hall once he is in.",
        "hall": 3,
        "meeting": 4,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "GFVYCdK8mS"
        },
        "objectId": "X35LqfhEa3",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "qJbJPzwwwb"
        },
        "updatedAt": "2015-09-29T10:28:54.817Z"
    },
	{
        "createdAt": "2015-10-06T04:46:25.807Z",
        "date": 4,
        "expanded": "I have really mixed thoughts on Angelica. On the one hand she's extraordinarily passionate and our coffee date had a vibe unlike any other I had. She has very passionate views and comes from a very unique background. That said her personality just rubbed me the wrong way in some ways. I'm not sure I see her as being a great fit.",
        "hall": 3,
        "meeting": 4,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "kcwZSbfWQv"
        },
        "objectId": "X9v9tW0ImZ",
        "pb": 3,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "sYH8uLg3cz"
        },
        "updatedAt": "2015-10-06T04:46:25.807Z"
    },
	{
        "createdAt": "2015-10-08T02:18:30.554Z",
        "date": 2,
        "expanded": "seemed like a thoughtful dude, but was pretty awkward for most of the time. he opened up a little bit when we spoke about journalism--it seemed like he had some good insight about being a person in the world. i definitely could see him contributing to the meeting, but he isn't the kind of person that i would really want to chill with",
        "hall": 3,
        "meeting": 4,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "kldlMuEeNt"
        },
        "objectId": "XMeasXOtf6",
        "pb": 3,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "sr4qoZDxfy"
        },
        "updatedAt": "2015-10-08T02:18:30.554Z"
    },
	{
        "createdAt": "2015-10-08T02:13:55.850Z",
        "date": 3,
        "expanded": "had a nice convo about avant garde theatre and music. independent thinker, good conversationalist. fits a certain type of hall member, but i wasn't wowed or anything",
        "hall": 4,
        "meeting": 3,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "kldlMuEeNt"
        },
        "objectId": "Y8dkBEDfT6",
        "pb": 3,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "zydDj0wlxO"
        },
        "updatedAt": "2015-10-08T02:13:55.850Z"
    },
	{
        "createdAt": "2015-10-05T19:29:04.390Z",
        "date": 5,
        "expanded": "Talking with Ashwin was an absolute delight. He jumped right into the conversation and not only kept it going but pushed back against ideas and suggested other experiences and opened up in response to my opening up. We talked for an hour before I realized that the rush party was about to start, and that we needed to wrap up. He’s so crazy and weird, in the most wonderful and different ways, and I would absolutely love to see him in the hall. Furthermore, I think he would buy in and he could really use the hall: he mentioned feeling out of place and drifting last year, especially in comparison to his expectations given his familiarity with the campus and his older sister’s experience here. I really would love to see him in the hall.",
        "hall": 5,
        "meeting": 5,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "eOOl5GK2aQ"
        },
        "objectId": "ZsxJwgRp8X",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "chihoWvNsW"
        },
        "updatedAt": "2015-10-05T19:29:04.390Z"
    },
	{
        "createdAt": "2015-10-04T18:28:38.444Z",
        "date": 3,
        "expanded": "My coffee chat with Eric was quite nice. We talked about his interest for film and his dreams of being a director, we also talked about his academic interest in Physics and how he hopes to bridge the gap between Physics theories and entertainment through his films. In this regard, I could see him making a fair number of contributions to meeting. On the more personal level, Eric was less stellar. There were moments when Eric took our silences to mean that he should continue to talk about himself. It surprised me that he rarely asked me questions about myself. I think that could be problematic for group dynamics. Finally, I think that he would not be able to commit (because of film and school) the time to the Hall that we are going toward in the future. Overall, I felt pretty neutral about Eric.",
        "hall": 3,
        "meeting": 3,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "xt5DyqVpe4"
        },
        "objectId": "aG9gzo3pyz",
        "pb": 3,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "CVtbhwZHWG"
        },
        "updatedAt": "2015-10-04T18:28:38.444Z"
    },
	{
        "createdAt": "2015-10-08T01:26:00.402Z",
        "date": 2,
        "expanded": "We got on some interesting topics, but this definitely wasn’t a stand out coffee date for me. He’s from Hong Kong, went to high school in London, then came here for Princeton, and is definitely an extremely intellectual dude with a lot of wisdom about social justice that I was really glad to talk about. He was involved with Petey Greene (am I spelling that right?). Talked about some pretty real family stuff which was nice. Not sure if we’re right for him. Would be curious as to what other people who met him or already knew him think.",
        "hall": 4,
        "meeting": 3,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "9tRoCjmjnJ"
        },
        "objectId": "awL6fO8Azk",
        "pb": 3,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "JqSoFinIRg"
        },
        "updatedAt": "2015-10-08T01:26:00.402Z"
    },
	{
        "createdAt": "2015-10-01T02:05:21.638Z",
        "date": 5,
        "expanded": "Really really good vibes at this date. She said she just felt like giving this a go after feeling sorority rush was absolutely not what she wanted (she was not hosed, she dropped). Her roommates are also rushing and she was encouraged to give it a go. She's from New Zealand, parents are electrical engineers that work on electric fences (cause sheep). Takes photos for the Prince (apologized for their content), plays croquet, and tried ballroom dancing. Seems like a really easy to talk to person and just all around really great.",
        "hall": 5,
        "meeting": 5,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "kcwZSbfWQv"
        },
        "objectId": "b9sjrumbI2",
        "pb": 4,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "BZHYTI7cPy"
        },
        "updatedAt": "2015-10-01T02:05:21.638Z"
    },
	{
        "createdAt": "2015-09-25T18:54:08.377Z",
        "date": 5,
        "expanded": "Moraiyo was a really pleasant person to talk to. Although she talked kind of loud. We got along fine but I dont think there was anything particularly spectacular about her. We talked a lot about food and her Chinese studies.",
        "hall": 4,
        "meeting": 3,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "poXrQxuYrn"
        },
        "objectId": "bSJf6Go4XP",
        "pb": 4,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "XVlSuIh7w2"
        },
        "updatedAt": "2015-09-25T18:54:08.377Z"
    },
	{
        "createdAt": "2015-10-06T19:10:55.402Z",
        "date": 5,
        "expanded": "Second best so far. Super super nice, super super deep, and super willing to share. We delved right into the importance of time in our lives, the best way to connect to those around you, the issues and benefits of being at Princeton. Only met for an hour due to time constraints, but wanted to keep talking for dayyys. Senegal! She kicked ass in Senegal! Thats awesome!",
        "hall": 5,
        "meeting": 5,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "z2iZWHONTb"
        },
        "objectId": "bT8uZR23Cp",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "4u0q4UrYDd"
        },
        "updatedAt": "2015-10-06T19:10:55.402Z"
    },
	{
        "createdAt": "2015-10-07T05:12:34.021Z",
        "date": 2,
        "expanded": "To be honest, it took me awhile to submit this report just because I wasn't sure what to say, exactly. I didn't have the best of times on this coffee date and it was a little disappointing. Bennett seems nice enough, maintained good eye contact and had a generally positive demeanor. He was so formal, though, and I felt as though I were conducting something more like a business interview, instead of a relaxed coffee date. At one point, I tried to tell him that our talk didn't need to be so serious, but he never let up on the formal vibe. \n\nWhat I got from our talk was that he's a libertarian, interested in political science, but is studying computer science. He's not particularly passionate about it, though… Or anything in particular (either that or he just didn't mention his passions? I'm not sure). It was difficult to get a sense of where he was coming from or how he thought about the world, because he didn't often elaborate on his statements. \n\nI felt at a loss for questions after awhile, because nothing came of them. Whenever I tried to be affable and sympathize with a story/tidbit of my own, he would seem almost thrown off by the fact that I was talking and sharing as well. I felt very uncomfortable talking to this person, and cannot see him in the setting of A's.",
        "hall": 3,
        "meeting": 2,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "dKDrhW55r4"
        },
        "objectId": "bjKMESJugP",
        "pb": 1,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "PxYwJDolW6"
        },
        "updatedAt": "2015-10-07T05:12:34.021Z"
    },
	{
        "createdAt": "2015-10-01T21:39:00.080Z",
        "date": 4,
        "expanded": "Again, I feel kind of incompetent judging a person after one coffee date (this is my third coffee date - mark it well!). My impressions of Bennett are that he is very low-key. He's very independent; he's not involved in a lot of on-campus groups, really just club squash, and one of the most interesting parts of our conversation was talking with him about how a lot of people at Princeton seem to do so much stuff that they actually hate and define themselves by the organizations of which they are a part. He doesn't feel compelled to join a lot of organizations because he thinks he can find time to do what they offer on his own time. I don't think this is a path most Princeton students feel comfortable taking, and I also appreciate the fact that I think a lot of students here have major identity crises that they try to fix by just doing more and more stuff - Bennett is not that kind of guy. That said, I can't tell whether he is really low-key and independent, or just not super engaged. \n\nHe was most engaged when having a casual conversation outside of philosophical / literary / academic stuff. Though he spent this summer chilling in San Fran and mostly reading philosophy and history of philosophy (he's majoring in COS but is super into analytic philosophy), he wasn't really engaged in talking about it so much. That said, I believe he's into it, and I never felt like he was trying to impress me with things he does or how literary he is or how many people he knows in As. He was more engaged in conversation around identity, skiing, and just sort of more human everyday subjects - also, libertarianism. So I think he'd give more of a grounded, everyman perspective in some of the LDs I've seen given this year - that is, if he would participate. \n\nHe is very frank and never felt self-conscious about being real on his stance toward fiction (he's not a fan) and doing stuff on campus. He didn't feel like he was trying to impress me, though he did definitely take his cues from me as opposed to initiating any part of the conversation, which could be a warning sign.\n\nUltimately, I would defer to JD's judgment of Bennett, since they seem to know each other pretty well. Bennett was thinking about rushing Cai Phi and I can honestly picture him more there than in St As (also have a feeling he's going to bicker Ivy). That said, I think he genuinely doesn't like feeling bound by a group and has a strong sense of personal identity, so if he's making the proactive choice to rush As, that means something, and he's doing it very purposefully. He's definitely not a person who would rush for the sake of rushing. He was also upfront with the fact that he doesn't know what As really is, or what he's going into, but he likes JD a lot and he likes the idea of fraternity and a club that is philosophically minded.",
        "hall": 3,
        "meeting": 3,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "BXD5r0f12R"
        },
        "objectId": "bqGn2BnbLH",
        "pb": 2,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "PxYwJDolW6"
        },
        "updatedAt": "2015-10-01T21:39:00.080Z"
    },
	{
        "createdAt": "2015-10-05T04:48:09.142Z",
        "date": 5,
        "expanded": "Devyn is honestly pretty cool. She's got a pretty great sense of humor as well. Our conversation was extremely comfortable and very easy. She has really interesting wonderful goals, she wants to go into the foreign service and is studying anthropology even though both of her parents are engineers (one for the Pentagon). She used to be a very competitive soccer player and cracked her skull open doing that but on the other hand also really cares about social justice and fashion. She's writes about really interesting stuff in class. All though she's in the humanities she doesn't shy away from writing about current important issues that relate to her life in her classes as well as in her poetry. One great story she told me was about standing up to a writing seminar professor who said her essay on black hair made her uncomfortable through her academic work. I really admired that and thought it was a brave smart thing to do. She has a really diverse background which makes me feel like she could talk to a lot of different people. She is really knowledgeable and opinionated but never was overbearing. This is all to say she seems like a complex interesting wonderful person. Also her dad makes bitmojis... come on.",
        "hall": 4,
        "meeting": 5,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "5n6bNbCWtV"
        },
        "objectId": "bsCqyKf3pF",
        "pb": 4,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "BfK1tJcREr"
        },
        "updatedAt": "2015-10-05T04:48:09.142Z"
    },
	{
        "createdAt": "2015-10-03T20:57:25.793Z",
        "date": 3,
        "expanded": "Tasha seemed thoughtful and ambitious. She was a little reluctant to share about herself, a little guarded. She has a ton of interests and we spoke about books for a bit, but didn't really get into anything to substantive. And that's fine, this was just a coffee date and I was a total stranger.",
        "hall": 3,
        "meeting": 3,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "kldlMuEeNt"
        },
        "objectId": "bzBXHTin08",
        "pb": 3,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "SqB0FD2Y4N"
        },
        "updatedAt": "2015-10-03T20:57:25.793Z"
    },
	{
        "createdAt": "2015-10-02T19:52:17.628Z",
        "date": 5,
        "expanded": "Before I get into the reasons why I think Zander would be a great fit for the Hall, I first want to say how much I enjoyed our coffee date on a basic, conversational level. He is just a really fun and interesting person to talk to, and it was a pleasure being able to meet him. \n    One of the most important qualities for A's members to have, I think, is the ability to communicate and engage with other people who have radically different backgrounds than they do. The prevalence of this trait in a particular class has a large say in determining how close the members are with each other and how well meeting runs. Zander clearly possesses this quality. I have almost nothing in common with him background-wise, and yet during the time I was with him, we never once ran out of things to talk about. He was great at making connections between interests and experiences that we have in common — for example, we are both interested in neuroscience and enjoy hiking and camping — but also wasn't afraid to talk about things that I know next to nothing about, like what a lacrosse \"highlight reel\" is, or the difference between NorCal and SoCal surfing. He was also genuinely interested in hearing from me about the Portland, Maine indie rock scene and my summer of thesis work. It is easy to imagine him contributing a lot in meeting, and really trying to get to know everyone in the organization well. \n    All in all, I think Zander really has the whole package. I could see him contributing to both the intellectual and the social sides of the Hall, and being a very involved member.",
        "hall": 5,
        "meeting": 4,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "3LKOUC17fE"
        },
        "objectId": "c51MCC5amf",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "psrcYsjgsY"
        },
        "updatedAt": "2015-10-02T19:52:17.628Z"
    },
	{
        "createdAt": "2015-09-25T01:15:22.237Z",
        "date": 4,
        "expanded": "Meeting with Sammy was really wonderful. He was extremely sociable, interesting, and easy to talk to. I try to be pretty open on coffee dates – to get a sense of whether the coffee date reciprocates in being open – and he continued the conversation very well but wasn’t the most revealing about things. He’s in Shere Khan and had talked to Scott a bit about the idea of A’s, and he is also very seriously considering AePI (sp?) He talked quite honestly at the end about how he wasn’t sure what to do regarding rush: he’s trying not to agonize over the decision, but he was attracted to the brotherhood aspect of AePI, as Shere Khan is coed, but he also enjoyed meeting both sophomores and members at the first rush party. I was his first coffee date, and he said multiple times that he really enjoyed it and is looking forward to hopefully having more (and to coming to the second party tonight). \nI could see him contributing at meeting. He said that he commits to whatever he decides on, and does so wholeheartedly, trying to reflect on decisions but not regret them and to really buy in to what he chooses. I believe him, and I think he could be a great contribution. He seems very happy and settled here socially – he has Shere Khan and club soccer and views them primarily as social groups – and I don’t think he “needs” A’s at all: he’s happy and settled here already. He wasn’t jumping to give really open or deep comments or stories, but he was engaging and interesting for the hour and change we spent chatting. I would be happy for him to be in the group, but am not jumping to really convince everyone he would be a great addition. I’m interested to see how his future coffee dates go / if he chooses to continue with A’s.",
        "hall": 5,
        "meeting": 3,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "eOOl5GK2aQ"
        },
        "objectId": "cXCyfKzhdc",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "xeuhNBsX6P"
        },
        "updatedAt": "2015-09-25T01:15:22.237Z"
    },
	{
        "createdAt": "2015-10-03T00:50:51.911Z",
        "date": 4,
        "expanded": "Alex is nice and easy to talk to. We talked some about religion, because she was an atheist until college and tried then Christianity but now seems drawn to Buddhism. We talked about whether people have souls or not, although I wanted to hear more of her thoughts and opinions since she has an interesting relationship to religion and studies neuroscience. We also talked about art because she took the Plato in Berlin seminar, and Plato thinks all art should be banned because it's dangerous. She pointed out that rom-coms give people very wrong ideas about romance which then impact their real lives detrimentally by giving them false expectations. We also talked about space travel because she said she would want to have kids but wouldn't want more than two for sustainability reasons. We talked about whether it's right to go to other planets as an escape plan, if we were the ones that messed this one up. We talked about interesting subjects, but I sometimes felt that she wasn't really expressing concrete opinions on the things we were talking about; she was somewhat passive. Also, when I asked her if she had questions about A's, she said a weird thing about calculating her chances of getting in (not sure whether to attribute that to overeagerness). All in all, there was nothing overtly wrong with this coffee date, it just didn't seem special or very memorable.",
        "hall": 4,
        "meeting": 4,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "5CRAKWB3Nr"
        },
        "objectId": "ct76doK4k8",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "PpB1kGxU6V"
        },
        "updatedAt": "2015-10-03T00:50:51.911Z"
    },
	{
        "createdAt": "2015-09-24T14:43:55.207Z",
        "date": 4,
        "expanded": "Christian was a great coffee date, a really funny, easygoing guy. We talked a lot about his family and where he is from (we talked for about 2 hours). He has great facial expressions. One thing I noticed was that I was the one who asked a lot of the questions, he would rarely pick up a lul in the conversation. Overall super chill guy, he might end up rushing AEPi though... stay tuned.",
        "hall": 4,
        "meeting": 3,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "poXrQxuYrn"
        },
        "objectId": "daX5Oa4N4v",
        "pb": 4,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "tDZPcddzOb"
        },
        "updatedAt": "2015-09-24T14:43:55.207Z"
    },
	{
        "createdAt": "2015-10-09T12:11:12.990Z",
        "date": 3,
        "expanded": ".",
        "hall": 3,
        "meeting": 3,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "GFVYCdK8mS"
        },
        "objectId": "dhBtC2xCyR",
        "pb": 3,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "J91jseEdNF"
        },
        "updatedAt": "2015-10-09T12:11:12.990Z"
    },
	{
        "createdAt": "2015-10-03T20:17:28.128Z",
        "date": 5,
        "expanded": "Oh my gosh! My coffee date with Alissa was one of the most cathartic experiences I've had in a while. Alissa is very in touch with her emotions in a way that is aware and at the same time constantly growing and changing. During our coffee date we just talked about the pressures that we feel in life and how our views on life were challenged or transformed by experiences in our past. Alissa is a wonderfully compassionate girl who has unfortunately had this compassion challenged countlessly by the world around her. However, during our conversation I was elated to see how comfortable she grew over the course of anecdotal tangents and rehashed feelings. By the end, I really saw a spirit that wanted to be kind and really was looking for an unconditional support system to help her grow personally. This is a girl who would benefit a ton from being part of the Hall. My one worry was that she would be too guarded to open up and make others comfortable during discussions. However, this worry faded away completely as she began to open up about very personal issues in her life, in a way that was neither asking for pity nor boasting personal suffering - all she was looking for was to share with someone who wanted her to speak her mind. After leaving out coffee date I felt an immense wave of loving energy that came from a feeling of connectedness that she evoked within me. It's kind of funny, because I don't either of us expected the conversation to be this incredible from the beginning (slightly awkward getting into the conversation), but by the end I felt like a great desire to be friends with her and continue to have these sorts of conversations with her.",
        "hall": 4,
        "meeting": 4,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "SmBf5on1pc"
        },
        "objectId": "eEmhqFmJ6R",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "ERBhsAUqAm"
        },
        "updatedAt": "2015-10-03T20:17:28.128Z"
    },
	{
        "createdAt": "2015-10-07T01:36:30.509Z",
        "date": 5,
        "expanded": "I felt really comfortable with Camila. She is a relaxed girl who you can feel comfortable opening up to pretty quickly. Our coffee date was spent talking a lot about family, home, and trying to find your identity on campus. She's going through the transformation where someone makes active choices about their environment and who they want to surround themselves with, which I think is incredibly mature, clear headed, and brave. While I didn't have an OMG spark with her or anything like that, she is someone I would really love to get to know more and become closer to overtime. Coming from a pretty big family, I think she has a great head on her shoulders and would be good at navigating the various dynamics in a group. She had a great attitude towards rush that I really appreciated, and seemed to approach the entire process with an open heart and good attitude no matter what direction it went in. I would love to hear what other people have to say about her, considering I have felt pretty out of it over the past few weeks so me not giving this an overall 5 might be my fault, but can definitely tell that others might have had exceptional experiences with her. Overall, I really like her and think she would do really well as a part of our pledge class. She's smart, open, asks great questions, and seems ready to meet and talk to anyone who is willing.",
        "hall": 4,
        "meeting": 4,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "3EhJDbwCry"
        },
        "objectId": "f1YEqTdslE",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "CksZqHste9"
        },
        "updatedAt": "2015-10-07T01:36:30.509Z"
    },
	{
        "createdAt": "2015-09-24T00:15:29.876Z",
        "date": 4,
        "expanded": "Really fun and dynamic person. The conversation was a great back and forth and didn't feel remotely forced. Initially a bit awkward as expected, but that devolved into a very organic conversation. She seems fun and unique. Also loves to mix drinks which is a plus.",
        "hall": 4,
        "meeting": 4,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "kcwZSbfWQv"
        },
        "objectId": "fI9JtfNcBP",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "nJb05s5Tdt"
        },
        "updatedAt": "2015-09-24T00:15:29.876Z"
    },
	{
        "createdAt": "2015-09-26T23:57:42.871Z",
        "date": 3,
        "expanded": "I enjoyed my coffee with Beth but I am going to say upfront that there were no 'wow' moments when I thought that she would be a really great fit for As. She spoke intelligently about her interest in archaeology and how she worked for a curator in a museum in her home town (Kansas city) this past summer and her plans to do field work in peru. We also had a nice conversation about how joining an a capella group (the tigressions) helped her find a good group of people after initial dissatisfaction with the res college system. From the way she spoke about and seems to value her a capella experience, I am confident that Beth would be an active and involved member of the hall. That being said, our conversation stayed pretty surface level the whole time and the way she spoke about her experiences was quite different to what I have become used to from LDs PBs/ just talking to all of you people on a day to day basis. It's possible that Beth was nervous because it was her first coffee date, so I am open to hear everyone elses experiences with her during rush.",
        "hall": 4,
        "meeting": 2,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "55fH46Ihxf"
        },
        "objectId": "fZk1CxhLpW",
        "pb": 3,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "A6U5bDZZxL"
        },
        "updatedAt": "2015-09-26T23:57:42.871Z"
    },
	{
        "createdAt": "2015-09-28T03:42:26.609Z",
        "date": 4,
        "expanded": "I felt extremely comfortable around Kyle, and also very interested by him. I think that he considers big questions and is healthily removed from Princeton in a way that helps him to analyze it. He did Bridgeyear Peru and we had some really interesting talking about service oriented projects like that, and their actual efficacy in the developing world. He's skeptical about the organization in general; didn't like the rush parties much (only went to part of the second one), but said he would continue the coffee dates, if only as a way to have some good conversations with some people (which I told him was a great outlook). We chatted for quite a while, and it all felt good. I'm not sure how unique of a perspective he would bring to the organization, but I would be totally happy to have him in it.",
        "hall": 4,
        "meeting": 4,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "eOOl5GK2aQ"
        },
        "objectId": "fkGb2Jsb6L",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "1YM0dei3yo"
        },
        "updatedAt": "2015-09-28T03:42:26.609Z"
    },
	{
        "createdAt": "2015-10-05T03:48:54.404Z",
        "date": 5,
        "expanded": "I loved my CD with Justinas. He is extremely intelligent and thoughtful and I learnt a lot about him, stand up comedy, Lithuania and Eastern European politics in our short time together. He also has a very dry and cheeky sense of humor which I always loved. I was continually impressed by his eloquence in explaining complicated ideas i.e geopolitical issues in the ex-soviet bloc and his equal engagement when discussing why he enjoys certain styles of comedy and the difficulty of replicating these styles when he performs. From first impressions, I would love to see him in an LD debating ideas with McGrory and Leifer and I think he would give a fascinating PB both because of his reflection and thoughtfulness and his life experiences that I think are very different to what we are used to. Justinas is self confident and although there were some brief moments where I thought he was being a little arrogant he would always follow up these comments with tasteful self deprecation. I also think he would love the social side of the Hall and I wouldn't have second thoughts about grabbing a pint with him any day of the week. I am really excited to hear what the rest of you all though of Justinas because he's a really interesting guy and I think he would absolutely love this group and would bring a lot of cheek and laughter",
        "hall": 4,
        "meeting": 5,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "55fH46Ihxf"
        },
        "objectId": "g5imkdpxNf",
        "pb": 4,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "Itd5BB6rVX"
        },
        "updatedAt": "2015-10-05T03:48:54.404Z"
    },
	{
        "createdAt": "2015-09-29T02:02:18.742Z",
        "date": 5,
        "expanded": "Max is a very down-to-earth dude. He seemed a little nervous at the very beginning, but when he loosened up he was super chill and had a lot to say. He's from L.A. but never learned how to drive! Which is really interesting and totally bizarre. He's probably gonna major in Philosophy but his gripe with the department is that they focus on Analytic and not Continental philosophy. He knows a lot about a lot of different thinkers; he's really into it. We also talked a fair amount about TV. He had a very insightful thought about the show Bojack Horseman (which I also watch and like), saying that in most comedy shows the writers will give a character a funny line that may not even make sense for the character to say and it'll have no repercussions for the plot. But Bojack is different because every little thing a character says has an impact on the story at large, rather than just having throw-away lines only because they're funny. I'd never thought of that before. It took me a while to figure out that what he's super passionate about is music -- he doesn't play an instrument or anything but he says working at WPRB has been the thing that makes him happiest at Princeton. He's a DJ there and gets to listen to the early copies of new stuff that record labels send. He's really into My Bloody Valentine and Deerhunter and can talk about music for a long time. When I asked him what genre he would play if he could play an instrument he said Shoegaze. He finds the sound of vocals (rhythm, melody, effects) more interesting than the lyrics (we have different opinions on that). His DJ name at WPRB is Johannes de Silentio, which he explained was the pseudonym that Kierkegaard originally published under. He's funny (in a dry way), super nice, and can talk a lot about things he's passionate about, and he doesn't seem self-centered.",
        "hall": 4,
        "meeting": 5,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "5CRAKWB3Nr"
        },
        "objectId": "hPQaOEtfww",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "PemcUzabRO"
        },
        "updatedAt": "2015-09-29T02:02:18.742Z"
    },
	{
        "createdAt": "2015-09-30T00:15:30.091Z",
        "date": 5,
        "expanded": "Dan has a totally different vibe than most people that I feel like I interact with - he isn't in your face in any way. His demeanor is soft, sincere, and kind of sad, but at the same time really supportive and encouraging. He is looking to help people and clearly finds joy in genuine connection. He may not \"jump off the page\", but I think he would be a hugely valuable member of a pledge class. I don't know him well, but I respect him and would love for him to be a part of this organization.",
        "hall": 5,
        "meeting": 4,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "kSGEshJdTB"
        },
        "objectId": "hvqkaBBt8R",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "5uZh6XmBuJ"
        },
        "updatedAt": "2015-09-30T00:15:30.091Z"
    },
	{
        "createdAt": "2015-10-03T22:00:00.631Z",
        "date": 5,
        "expanded": "Amazing coffee date. I absolutely loved meeting Ugonna. She is incredibly kind and thoughtful and is a fantastic listener. I really enjoyed her calmness and reflection talking about a wide range of things like how she got into theater here and how her experience on campus changed after the events in Ferguson last fall. She was really interested in hearing about my take on those events both as a non-American. Her thoughtful questions and attentive listening helped me to think about these things in more detail than I previously had done and I really appreciated that experience.  I am certain that Ugonna would bring those same qualities to meeting and I would feel completely comfortable giving my PB to her. I really really hope lots of you had the chance to meet to Ugonna because I enjoyed our chat so much.",
        "hall": 4,
        "meeting": 5,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "55fH46Ihxf"
        },
        "objectId": "i2li4ztMsJ",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "f9p9mh6aYe"
        },
        "updatedAt": "2015-10-03T22:00:00.631Z"
    },
	{
        "createdAt": "2015-10-02T16:39:46.205Z",
        "date": 4,
        "expanded": "He was a nice enough guy and was super easy to talk to. in my opinion there is nothing too special about him. he might need the hall but i am not convinced that the hall really needs him (might read more harshly then i intend it to).",
        "hall": 4,
        "meeting": 4,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "poXrQxuYrn"
        },
        "objectId": "i9hcrUfOnx",
        "pb": 4,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "OFZApgScL1"
        },
        "updatedAt": "2015-10-02T16:39:46.205Z"
    },
	{
        "createdAt": "2015-09-26T02:28:18.677Z",
        "date": 1,
        "expanded": "rushed a sorority",
        "hall": 1,
        "meeting": 1,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "z2iZWHONTb"
        },
        "objectId": "iShJW5SJC9",
        "pb": 1,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "e3TgfifrSG"
        },
        "updatedAt": "2015-09-26T02:28:18.677Z"
    },
	{
        "createdAt": "2015-09-26T19:34:39.886Z",
        "date": 3,
        "expanded": "My chat with Sam was very typical Princeton, he's a good guy who's driven to learn, very focused on his studies, and interested in expanding his social circle. I am rating his potential contribution as average because nothing he said really blew me away. It's possible I didn't get into the core of what he is curious about, and have no negative opinions about him. Hopefully he can meet a few other people and open up more so that we have a better sense of what his impact might be.",
        "hall": 4,
        "meeting": 3,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "ASabXj3jqQ"
        },
        "objectId": "iiHqGEUWC8",
        "pb": 3,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "OFZApgScL1"
        },
        "updatedAt": "2015-09-26T19:34:39.886Z"
    },
	{
        "createdAt": "2015-10-09T00:13:08.811Z",
        "date": 5,
        "expanded": "Kekoa is literally perfect. If he isn't in As, then I quit. \n\nHe is wonderful, inquisitive, contemplative, the smiliest person in the world, and absolutely one hundred percent perfect for this organization. I cannot overestimate how much I enjoyed our coffee date and how perfect he would be for As. I also cannot overstate that if he does not get in, I will be WROTH.",
        "hall": 5,
        "meeting": 5,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "BXD5r0f12R"
        },
        "objectId": "jegDJgCnrA",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "07XaowMRwB"
        },
        "updatedAt": "2015-10-09T00:13:08.811Z"
    },
	{
        "createdAt": "2015-09-25T19:35:42.869Z",
        "date": 5,
        "expanded": "I had a great conversation with Joy. She seems like she was in a similar place as me when I was rushing A's. We talked about finding a good group of eclectic friends on campus and also how exhausting conversations are in general. She is definitely a fellow seeker. She did mention how she wanted to be in theta and was hosed from them today. That made me feel kind of weird just like A's was her second choice. But I think she is just looking for a solid group of cool people, which is what A's is.",
        "hall": 5,
        "meeting": 4,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "poXrQxuYrn"
        },
        "objectId": "jgaX7udGgQ",
        "pb": 4,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "cjtOossneS"
        },
        "updatedAt": "2015-09-25T19:35:42.869Z"
    },
	{
        "createdAt": "2015-10-06T07:33:08.339Z",
        "date": 4,
        "expanded": "Conversation with Jared came incredibly naturally and easily. We met very briefly at a rush party, but hadn’t really had a chance to talk, and the moment we sat down for our coffee date, we delved fairly fast into some pretty personal subjects. I’m not sure how it came up so quickly, but we got onto the subjects of sex, gender and sexuality mere moments after sitting down. He readily opened up about his sexuality and his personal experience coming out (accidentally) to his mom, his parents’ reaction and his experience in the gay community at Princeton. We discussed the LGBTQ community here more generally and lamented the reluctance, even unwillingness, at Princeton to be open and honest about issues related to sex and sexuality. We were wondering why the male homosexual contingent on campus so far outnumbers the lesbian community, which brought us to a really interesting discussion of the feminist movement and how it compared to the homophile movement, how the AIDS epidemic transformed the public image of the homophile movement into a cohesive, yet largely male-dominated one. It was really fascinating and these are subjects I’ve studied a lot, a lot, so I ended up sort of rambling, but Jared seemed genuinely interested and not only listened with open ears but offered some really interesting counterpoints.\n\nI was mainly excited by this part of the conversation because I feel like the tendency in coffee dates is to talk exclusively about ourselves, to get bogged down in the details of our somewhat little lives (I say “our” for a good coffee date—“their” for a not so good one I guess), and it was very refreshing to talk about something so historically significant and so much bigger than ourselves. And also to think about the Princeton community in the much grander scheme of history as opposed to simply a collection of figures that stick out in our minds, the individuals that we know that make campus what it is for us.\n\n“Fun Home” came up—the Broadway show that won the Tony for best musical this year. I really enjoyed the show and expressed that opinion pretty quickly. Since he has a lot more experience with theater, he looked at it with a more critical and discerning eye and wasn’t at all afraid to disagree with me, which I really appreciated. He didn’t like the show very much and told me flat out and then explained why. It was a really simple moment in the conversation, but I just appreciated that he didn’t try to stroke my ego and blindly agree with me even in the sort of weird power dynamic context of a coffee date. Aside from some technical issues with the score and set composition and direction (which I can’t recall off the top of my head), he was really upset by the fact that in this day in age a musical can still be lauded as “revolutionary” simply for broaching the topic of sexuality. I couldn’t agree more with this opinion even though it’s a somewhat counterintuitive conclusion to draw. This brought us to a larger discussion of the representation of gender and sexuality in theater, and how it, moreover, relates to gender performativity off stage, in real life—all of which I think Jared could offer a killer LD about.\n\nI can’t really put a finger on what my concern is with Jared, because I got along with him really well, but I definitely worry that he just might not fit with the group dynamic. It’s not so much that I think he wouldn’t offer an interesting perspective, because I do believe he would, I suppose it’s more the way in which he talks about the things he brings up. For example, he continually apologized for “unraveling” or “unwinding,” as he put it, and felt a bit uneasy and embarrassed—not so much about opening up personally, because I think that’s a really understandable thing to be uncomfortable about with a perfect stranger—but about discussing more serious subjects with someone he had just met. I kept on assuring him there was no need to apologize but it sort of just messed with the flow of the conversation, because I wasn’t at all ill at ease. Quite the contrary. So I just sort of wish he had gone with it and embraced the conversation, because it truly was an interesting one.\n\nHe’s also really involved in several groups on campus—disiac, triangle, footnotes (though he hinted that he may drop that?)—which isn’t a bad thing at all, but he does seem really invested in these groups and may not, for that reason, have a massive amount of time or energy to invest in A’s. But that’s just a projection of which one can never be certain. The last strange moment was when he told me that I was his favorite coffee date. At first very flattered, I was startled when he qualified the compliment by saying he thought we got along so well because we had so many mutual friends. Startled both because we hadn’t been throwing around a bunch of names, so I wasn’t sure where he got the idea we had so many friends in common, and, more importantly, because I think we got along for entirely different, more substantial reasons, mostly certain shared interests and a conversational chemistry that I wouldn’t want to boil down to “mutual friends.” So that was an odd moment, but overall I really did enjoy my coffee date with Jared.",
        "hall": 3,
        "meeting": 4,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "6NmejqZ4eu"
        },
        "objectId": "jvRTNrg1ah",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "2IjCocxTzn"
        },
        "updatedAt": "2015-10-06T07:33:08.339Z"
    },
	{
        "createdAt": "2015-10-06T18:41:09.611Z",
        "date": 3,
        "expanded": "Wilglory seems like a very strong willed intelligent woman. I feel really ambivalent because I like her drive, focus and passion but on the other hand, at times I felt like this was an interview rather than a coffee date and that I was the one being interviewed for a job I didn't apply for. Yet, I enjoyed that because we had an actually meaningful conversation rather than a bunch of small talk and a bunch of us agreeing on very meaningless things. I really want to hear what others had to say about her. I was impressed by her passion but at times I was on the border of feeling put off. \nShe seems like a very hard working, independent organized person, which I appreciate a lot. She does a lot of very cool things and I think that kind of passion would do our organization a lot of good.",
        "hall": 4,
        "meeting": 4,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "5n6bNbCWtV"
        },
        "objectId": "k6wvBYgIb4",
        "pb": 3,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "awMgpjZI4i"
        },
        "updatedAt": "2015-10-06T18:41:09.611Z"
    },
	{
        "createdAt": "2015-09-28T01:26:52.773Z",
        "date": 4,
        "expanded": "Overall, this was a good coffee date. Victoria is a fun person to talk to, and is clearly rushing the Hall for the right reasons. I could not only imagine her contributing a lot to meeting, but also being a great listener — the type of person who would make whoever is giving their PB feel more comfortable doing so. In the hour or so that I talked to her, I asked about a lot of different things, but couldn't really figure out whatever it is that makes her tick. I'll be interested to hear what her other coffee dates say.",
        "hall": 3,
        "meeting": 4,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "3LKOUC17fE"
        },
        "objectId": "kR20JlRDg1",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "DhbcvjSVjN"
        },
        "updatedAt": "2015-09-28T01:26:52.773Z"
    },
	{
        "createdAt": "2015-10-04T21:22:24.165Z",
        "date": 5,
        "expanded": "I do not think this report can adequately convey how much I think that Abby needs St. As in her life. Our conversation started off with the basics, an exchange of names and hometowns, funny stories and majors. We quickly moved on from that to talk about how Abby grew up in a house that doubled as Bed \u0026 Breakfast. From there, we talked about Princeton and it is through this portion of the conversation that I really began to feel as though Abby needed As. Her first year at Princeton, similar to mine, was tough. To the degree that she does not feel as though she has found a solid group of friends. We talked about the importance of friendship and she expressed to me how she has had trouble finding people whom she can trust or feel committed to. We then went on to talk about morning routines and how she finds fault in the campus culture because of the need to be on all of the time. The reasons I think Abby needs A’s and that she can add to the hall. She needs it because I think we will give her the community that makes her feel less insecure and more loved at Princeton. I think she is struggling to find people to relate to (being a student on financial aid and not really wanting to be a part of the stress). I also think that she would add a great amount to meeting and she is one of the few people that I have met who I could see being a part of any pledge class. Her thoughtfulness and selflessness coupled with her genuine interest in making a connection makes her one of the more candidates for the Hall. It would be a shame to lose an opportunity like this.",
        "hall": 5,
        "meeting": 5,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "xt5DyqVpe4"
        },
        "objectId": "kdyBICdRmU",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "CXwWRsVrR1"
        },
        "updatedAt": "2015-10-04T21:22:24.165Z"
    },
	{
        "createdAt": "2015-10-03T21:48:39.954Z",
        "date": 3,
        "expanded": "I enjoyed my chat with Allison. She does a huge amount on campus-- quipfire, triangle writing, shows, and she even just joined the Nass. It was good to hear about all of these things and she spoke very intelligently. That being said, the conversation never really hit the levels of the incredible coffee dates that many of us have had. Things stayed in interview mode which was a shame and I found myself thinking up conversation topics which is never a great sign. I think it's possible that there just wasn't the best chemistry between us and I'm very curious to hear what others have to say as I feel like i didn't get a good sense of how she might fit in with our group.",
        "hall": 3,
        "meeting": 4,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "55fH46Ihxf"
        },
        "objectId": "l5kenE9lF4",
        "pb": 3,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "4ztTSRITYT"
        },
        "updatedAt": "2015-10-03T21:48:39.954Z"
    },
	{
        "createdAt": "2015-09-29T10:49:45.502Z",
        "date": 4,
        "expanded": "Basic facts: \n- Mother is from Slovakia and father from Ethiopia\n- Interested in fashion. http://www.stripemag.com/author/sd8/\n- Studies economics but took a few classes related to fashion\n- Last summer, she worked at Food and Water Watch near her hometown.\n- She BAKES! Worked at Cold Stone Creamery as a cake decorator.\n\nInteresting story about how her parents met. During the 1950~60s, the Soviet Union sent talented people from communist countries to study in the Soviet bloc. Her father was studying mechanical engineering in Ethiopeia and was sent to Slovakia on a scholarship. He met her mother there and lived until Sara was 9.\nHowever, because his father felt racism was too strong in Eastern Europe, he moved to the United States. She goes back to Slovakia often to see other family members.\n\nShe was not the most talkative person so I had to ask a lot of questions to get answers. But I could easily imagine her opening herself more as she gets more comfortable and become less shy. In some way, she reminded me of Sydney.\nAmong the topics we talked about, I could relate the most to her on how our parents (hers being immigrants and mine being non-U.S. citizens) wanted us stay away from the path to the humanities and study something related to business.\nShe seems to have the same kind of conflicts I had before I came to the hall and eventually declared philosophy as major. Not only would she contribute to the hall, I think the hall might greatly influence her life decisions.\nBesides, she is just so sweet and down-to-earth that I am confident that other members would love her and feel comfortable to be around her.\n\nFor my personal reason, I would love to have in the hall someone who could bake.",
        "hall": 5,
        "meeting": 4,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "GFVYCdK8mS"
        },
        "objectId": "mlhGe4hcmq",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "LnWn2o3HHB"
        },
        "updatedAt": "2015-09-29T10:49:45.502Z"
    },
	{
        "createdAt": "2015-09-26T18:40:21.882Z",
        "date": 5,
        "expanded": "I absolutely loved Alissa and want her to be in A’s. She was one of those coffee dates when you’re so fired up about the person – and not just because of being in agreement on things. She offered some new and challenging perspectives that I already feel I’ve learned from, and the conversation easily flowed for an hour (when I was surprised an hour had passed and regrettably had to leave!) She had a healthy (in my opinion) skepticism of A’s but is enjoying meeting everyone – members and sophomores alike – and mentioned that regardless of whatever image is projected or assumed about groups on campus, she tries to get to know what they’re really like, and that applied to A’s as well. She was powerfully open-minded. Her father is Mexican and her mother Hungarian, and she did BridgeYear in India, and I think would provide fascinating opinions and experiences to the group. She does a few things on campus but would eagerly engage in the group as a pledge and member, I think. I see her actively reflecting and participating in meeting, and I would almost be comfortable giving my PB to her right now. She’s phenomenal, and I’m so glad to have met her and hope that she gets in.",
        "hall": 5,
        "meeting": 5,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "eOOl5GK2aQ"
        },
        "objectId": "mnbRHADnBV",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "ERBhsAUqAm"
        },
        "updatedAt": "2015-09-26T18:40:21.882Z"
    },
	{
        "createdAt": "2015-10-02T06:02:29.993Z",
        "date": 5,
        "expanded": "I had a terrific time talking to Erin!  The coffee date lasted two hours, and we really only stopped talking because Small World was closed… We talked about many things; I learned about her home in England, her family, her thoughts on Princeton and America in general. We also talked a lot about more conceptual ideas, regarding culture, displacement, psychology of objects and fear of failure. She was honest in her answers, which I really appreciated. But also didn't seem so quick to judge others in a negative fashion. For example, we bonded over the fact that we went to both the first A's rush party and the first sorority rush event; we commented on the spectacle of sorority rush, empathizing with each other over the fact that it \"wasn't our thing.\" And yet, she always returned to the idea that everyone should go where their interests lie, and should be able to enjoy their own activities and groups without being looked down upon or thought of as \"less than.\" In this way, I felt that while we could sympathize with each other on feeling distanced from certain things (including sorority rush, instagram photos of dinner, having overbearing parents), our perceptions of those groups or \"other\" people were never negatively colored. And her attitude was not self-righteous in any way; it was more thoughtful and conscientious, if anything. \n\nShe thinks a lot about the world around her, about her own thinking and how to improve it. She said that she went through a kind of \"mental revolution,\" which I didn't get the chance to ask about, but would have loved to hear more. I think it had to do with her transition from freshman to sophomore year; she spoke about feeling anxious during her first year at Princeton, experiencing an environment full of expectations and pressure. It seems that she's constantly trying to improve herself, and better her way of thinking or living. She seems to truly enjoy learning and engaging in conversation and ideas… I felt that our conversation was both enjoyable and generative – I felt quite comfortable talking to her. The only thing I wonder about is her capacity for empathy, but that's only a feeling I have, not really grounded in any particular instance in the conversation. Overall, I liked her very much. A two hour coffee date isn't enough time to really get to know a person, and there's still much more I wish we could discuss.",
        "hall": 5,
        "meeting": 5,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "dKDrhW55r4"
        },
        "objectId": "nEdmPzjTfq",
        "pb": 4,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "nJb05s5Tdt"
        },
        "updatedAt": "2015-10-02T06:02:29.993Z"
    },
	{
        "createdAt": "2015-10-07T21:18:18.214Z",
        "date": 4,
        "expanded": "Tasha is really kind, motivated, and looking for relationships that I think she could find in the hall. I really respect her and would enjoy her friendship, but I also didn't feel that we absolutely must have her. I was only her second coffee date, though, so hopefully she can see someone else before friday so she there are more people who can consider her more fully.",
        "hall": 5,
        "meeting": 3,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "kSGEshJdTB"
        },
        "objectId": "nXNl6H6hB2",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "SqB0FD2Y4N"
        },
        "updatedAt": "2015-10-07T21:18:18.214Z"
    },
	{
        "createdAt": "2015-09-25T19:47:24.638Z",
        "date": 4,
        "expanded": "I had a really lovely coffee date with Alex. I say 4 mostly because this is my first time and I want to reserve 5s for when I feel super \"wowed\" by a genius or something. We flowed extremely well, she seemed very curious and interested in a wide variety of stuff, especially neuroscience and consciousness and philosophy and spirituality. She isn't the most eloquent person in the world, but she seems very contemplative. We had a conversation as opposed to a series of \"deep monologues\" on both of our parts, which was nice. She seems extremely open to new ideas and non-judgmental, which I think would be great for meetings and PB. \n\nI think she's also the kind of person who takes initiative: she's doing the HUM sequence as a sophomore (!) because she feels like she really should, despite majoring in a science and feeling some amount of pressure re: practicality. She also is into doing stuff and taking advantage of what the community has to offer: she's artsy and invited me to Catholic mass on Sundays. Basically it seems like she is experiencing a wider variety of stuff at Princeton than just, say, a library. I also think she has a good handle on the amount of space you should have in your day to be a person; she certainly wasn't trying to impress me with achievements or extracurriculars, and I think she is different from a lot of Princeton students in that respect. I still struggle with over scheduling, so that kind of ease of being and purity of intent is important to me. \n\nI think she would do well with As socially in that it seems to me she's rushing because she's looking for good intellectual and intimate conversations that she hasn't been able to find up to this point. She was thinking about transferring to Columbia at some point last year, though now she feels happier in the community. \n\nOverall, she's a nice, grounded person (from Ohio!) who seems contemplative, curious, and like an essentially good soul. I think she would be a great listener, especially for PBs. I do not know how much she would talk in meetings. She seems more introspective than hyper fluid with her thoughts. She's also less \"fast\" than most Princeton students; she's moving at a pace which feels to me more relaxed and ultimately has more breathing space, but she isn't \"quick\" or \"snarky.\" Feel free to ask me to clarify if that doesn't make sense. I think it's a good thing. \n\nThat said, she seemed inclined to agree with me on a lot of points. I think this is probably because she feels the same but I also think she's a lot like water in that she goes with the flow (she's a very \"flow\" kind of person). I don't know to what extent she is an \"original thinker\" - she didn't give me ideas that were her own, she usually attributed them to someone else (either famous or a friend) - so my larger impression when I walked away from the coffee date was that she was extremely easy and fun to talk to, has a really good vibe, but she didn't revolutionize my way of thinking about anything. And I don't think that's a problem. Her way of pushing the conversation was more amiable and exploratory than friction-filled and thought-provoking.\n\nTo sum: I think she'd make a good member. And I don't think she's in it to social climb; she genuinely wants these kinds of conversations. That's all.",
        "hall": 4,
        "meeting": 4,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "BXD5r0f12R"
        },
        "objectId": "nkYldWjq5u",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "PpB1kGxU6V"
        },
        "updatedAt": "2015-09-25T19:47:24.638Z"
    },
	{
        "createdAt": "2015-10-08T23:47:39.276Z",
        "date": 5,
        "expanded": "So, there is really not much more to say then I think that Ugonna would be absolutely perfect for As. Like wow. To begin, she is an incredibly insightful and down to earth person but she has many of the qualities that make a great As member (this is me thinking beyond the pledge stage). I know that there is no formula for a good As member -- that is what makes us all so special and unique and yadda yadda. However, I do think that there are qualities we all share that allow us to function as the very special group of people we are. I think that Ugonna has some of them. First, when I asked her how she was enjoying the rush process -- Ugonna answered that she was happy to have met so many cool people. When I asked her to elaborate, she said it was the number of different sophomores the most and that she was doing the process to just go along with it. I found it interesting (and maybe I should not have) that she did not have any questions about As as an organization. She then began to ask me a slew of questions about what it was that I liked doing (never what I did or have been doing on campus). We had a series of comfortable silences (which I have only ever had on one or two other dates and really take as a good sign). Though she describes herself as introverted, Ugonna told me about how she did not come to Princeton doing theater but ended up in it. Now, it is something she loves. One of my favorite parts of our coffee date was listening and watching her talk about acting and what it did for her. She described wanting to try directing because she wanted to prove to herself that this was something she could do and for no other reason beyond it would be an interesting challenge. I just loved how her face lit up and though acting is a challenge for her and she finds herself nervous before every show and how she wants to try her best to embody each character. We also had conversations beyond art, talking about how she was often judged based on her appearance and what that meant for her and how she treated people. I could honestly go on for pages about what we talked about and the care with which Ugonna expressed her opinions, but I won’t. I will say that letting her into As would not be a mistake and would add so much to any class. She has a light in her that I can’t quite explain and I think it would be a shame to miss it.",
        "hall": 5,
        "meeting": 5,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "xt5DyqVpe4"
        },
        "objectId": "nom4FH6mT9",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "f9p9mh6aYe"
        },
        "updatedAt": "2015-10-08T23:47:39.276Z"
    },
	{
        "createdAt": "2015-10-08T23:53:43.444Z",
        "date": 3,
        "expanded": "Amina is really sweet, and really thoughtful. She has this really soothing energy and passion about her. It made me super comfortable. She seems like just the right amount of skeptical which I appreciate. She has lived some interesting unconventional experiences, like bridge year Senegal and has been other place. She seems like an adventurer. (Too many coffee dates, don't know what to say anymore)",
        "hall": 5,
        "meeting": 3,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "5n6bNbCWtV"
        },
        "objectId": "o98735jqv5",
        "pb": 4,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "3CyUGtpVq5"
        },
        "updatedAt": "2015-10-08T23:53:43.444Z"
    },
	{
        "createdAt": "2015-10-07T18:00:12.985Z",
        "date": 4,
        "expanded": "Kekoa is a really chill and optimistic guy. He's also pretty smart and thoughtful and I had a good time talking to him about theories of history and philosophy of the mind (that's his favorite new thing). His positive perspective on Princeton is something I have rarely heard. He absolutely loves his classes and can't imagine any other career than academia. He feels like he's missing out on meeting a lot of amazing people at Princeton because he still mainly socializes with his friends in Forbes and he was quite up front about why he was rushing: he was brought along to one of the rush parties by a friend, thought everyone he met was really chill and interesting and so is keen to get to know all of us more. I appreciated the honesty and it seems like he's looking for another social community at Princeton. As a result, I think he would be very very committed if he was a part of our group. That being said, I'd be interested to hear what other people think about Kekoa because I really like him as a person and think I he would love pledging and the new community but I struggled to get a sense of him in meeting etc",
        "hall": 5,
        "meeting": 3,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "55fH46Ihxf"
        },
        "objectId": "ogXb77dr9G",
        "pb": 4,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "07XaowMRwB"
        },
        "updatedAt": "2015-10-07T18:00:12.985Z"
    },
	{
        "createdAt": "2015-10-09T02:29:40.154Z",
        "date": 3,
        "expanded": "Joy is a sweet girl but this was not one of my better coffee dates. I enjoyed hearing her talk about synchronising her writing with listening to classical music. There was a slightly strange vibe because she seemed quite melancholy about sorority rush and the conversation kept going back to it which was a little unusual. Joy sent me a really nice follow up text/book recommendation which I appreciated. In all honesty, I'm not sure how I picutre her fitting in with the group but would interested to hear what other people have to say",
        "hall": 4,
        "meeting": 2,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "55fH46Ihxf"
        },
        "objectId": "pP8juJVsPe",
        "pb": 3,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "cjtOossneS"
        },
        "updatedAt": "2015-10-09T02:29:40.154Z"
    },
	{
        "createdAt": "2015-10-06T17:54:15.937Z",
        "date": 5,
        "expanded": "Really such a organic and fun conversation. She struck me as very down to earth and comfortable in her own skin but also kind and interested in everything I had to say. We started by first talking about gender and sexuality and how this is what she's interested in. The conversation then meandered from traveling to our parents (her mom is a goldsmith, cool!). I really really loved this coffee date and could absolutely see her in the hall.",
        "hall": 5,
        "meeting": 5,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "kcwZSbfWQv"
        },
        "objectId": "pXm9JdNRV0",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "cCORD4pTj3"
        },
        "updatedAt": "2015-10-06T17:54:15.937Z"
    },
	{
        "createdAt": "2015-10-07T04:25:33.660Z",
        "date": 5,
        "expanded": "My coffee date with Lydia was by far the best one I've had so far. We just talked for a really long time and it wasn't awkward at all and didn't feel like an interview. I think she's absolutely perfect for the Hall. She just published a new piece in the Nass (I read it, it's great). It's the first really personal thing she's published, and she was saying how it's felt really great to have people here and from her high school supporting her art by reading it, especially because this piece isn't fiction. We also talked about the concept of friendship, because she took a course here on the subject, and she's found herself wondering this year if it's okay to lose touch with people she used to be friends with. She's really smart and really into theater -- she's the original projects director at Intime. She wants to get back into acting, because she did it a lot in high school but hasn't yet done any here. Her favorite play is Arcadia, and we talked a while about my favorite play, This Is Our Youth, because we both saw the same production of it, and we talked about how amazing it was. She's not afraid to have critical opinions of things, like certain aspects of campus theater. We also bonded over both being only-children from NYC. All-in-all, an extremely enjoyable coffee date. She should certainly have a place in A's.",
        "hall": 5,
        "meeting": 5,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "5CRAKWB3Nr"
        },
        "objectId": "pnj4r9snD8",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "cCORD4pTj3"
        },
        "updatedAt": "2015-10-07T04:25:33.660Z"
    },
	{
        "createdAt": "2015-09-27T22:40:53.589Z",
        "date": 5,
        "expanded": "I really liked jared a lot. He has lead an interesting life and he has a very personable approach to conversation. I would say 8/10 but I also think he might be a bit too committed to other groups to be a great pledge (triangle, disiac, theatre stuff in general). that being said he has been my favorite coffee date thus far.",
        "hall": 3,
        "meeting": 4,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "poXrQxuYrn"
        },
        "objectId": "qfclTeKPb5",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "2IjCocxTzn"
        },
        "updatedAt": "2015-09-27T22:40:53.589Z"
    },
	{
        "createdAt": "2015-10-06T00:40:15.661Z",
        "date": 4,
        "expanded": "I really like Olivia. I felt like she had a very interesting perspective on a lot of European /American differences and what it was like to be in the US as an international student. She was engaging and fun. She was also really cool. Definitely one of my favorite dates so far, but she also came off a little bit as being a little bit edgy for the sake of being edgy and not genuine. Her summer in India sounded wild, and she seemed to be super engaged with the work that she did there. I loved her thoughts on the bureaucracy of India and how different time is perceived there. I think that she would contribute a lot to the perspective on LDs and would have a really interesting PB.",
        "hall": 4,
        "meeting": 4,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "pAMJgmz7nJ"
        },
        "objectId": "qmcF9fCQOe",
        "pb": 4,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "aiFB8UBPlp"
        },
        "updatedAt": "2015-10-06T00:40:15.661Z"
    },
	{
        "createdAt": "2015-09-27T22:38:29.843Z",
        "date": 5,
        "expanded": "I had a great time with Justinas! He loves to talk and he is actually pretty funny. He name dropped everyone he knows in the hall pretty early on in our conversation which was a bit weird, but he seemed to be approaching rush in the right way (not taking it too seriously, having fun). In terms of diversity the fact he is from Lithuania is pretty cool... He was super duper easy to talk to, although he didnt seem very comfortable with silence. I get the sense that he thinks he is the shit. Still trying to figure out if that is in a good way or a bad way.",
        "hall": 4,
        "meeting": 5,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "poXrQxuYrn"
        },
        "objectId": "r8crXlFEaO",
        "pb": 4,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "Itd5BB6rVX"
        },
        "updatedAt": "2015-09-27T22:38:29.843Z"
    },
	{
        "createdAt": "2015-09-30T02:49:35.176Z",
        "date": 3,
        "expanded": "I just got a rather unsettling vibe that he was rushing As for a social aspect/had this view that wealth was a way into the organization. The conversation didn't feel organic and wasn't one that I enjoyed.",
        "hall": 4,
        "meeting": 2,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "kcwZSbfWQv"
        },
        "objectId": "rXD00giL1p",
        "pb": 2,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "JqSoFinIRg"
        },
        "updatedAt": "2015-09-30T02:49:35.176Z"
    },
	{
        "createdAt": "2015-10-01T19:35:32.367Z",
        "date": 5,
        "expanded": "Really really down to earth guy who seems genuine and just all around very kind. A drummer in an Africa acapella group, plays tuba, and does a lot of mentoring both for college applications and younger underprivileged students. I think he's a little shy and wasn't sure what the vibe was initially but it just felt really natural within 10 minutes in. I think he would be a great stabilizing force in the pledge class.",
        "hall": 4,
        "meeting": 4,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "kcwZSbfWQv"
        },
        "objectId": "sBvTHpKaRC",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "J91jseEdNF"
        },
        "updatedAt": "2015-10-01T19:35:32.367Z"
    },
	{
        "createdAt": "2015-10-02T14:06:20.794Z",
        "date": 4,
        "expanded": "I really enjoyed my coffee date with Avanthi. She seems like she's really fun and down to earth. She's from the Princeton area and talked about how nice it is to be able to go home on weekends. She's in the Edwards Arts Collective and part of glee club and Pure (?) the rock ensemble. She talked about how excited she was to be singing in Pure this year since it's something she really liked to do in high school. She was traveling this weekend to see Dean Smith's inauguration at Swarthmore because they were close, which I thought was really cool of her. She does seem to have a heavy course load and to like the study/sleep cycle so I'm not sure how much time she would spend just chilling with the Hall socially.",
        "hall": 3,
        "meeting": 4,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "pAMJgmz7nJ"
        },
        "objectId": "sfIcvz3KLd",
        "pb": 4,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "krw0sjctDe"
        },
        "updatedAt": "2015-10-02T14:06:20.794Z"
    },
	{
        "createdAt": "2015-09-26T19:29:28.836Z",
        "date": 5,
        "expanded": "Although initially awkward, my coffee date with Dipo was amazing. Dipo is someone with very fully formed ideas about life. He would contribute meaningfully to meeting, presenting a very reflective perspective that most of us do not experience. He is active about his pursuit of expanding his perspective, and I think he would be able to foster meaningful conversations among members of the hall even outside of meeting, which is an area we can improve.",
        "hall": 4,
        "meeting": 5,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "ASabXj3jqQ"
        },
        "objectId": "swKA2KlSm3",
        "pb": 4,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "80YfRKQRV0"
        },
        "updatedAt": "2015-09-26T19:29:28.836Z"
    },
	{
        "createdAt": "2015-09-30T22:57:23.674Z",
        "date": 5,
        "expanded": "Honestly, this was just a very wonderful and humbling conversation. This girl is so funny and so quirky and so strong and driven and so humble. She is very anxious and has a lot of energy but her conversational skills, her focus and the things she says are so entrancing, I only realized how anxious and energetic she was because the table we were sitting at was vibrating. She has a really interesting story and background (truly very unique and different from anyone we currently have among us). She is light and quirky and funny even though her life really hasn't been simple or easy nor has her Princeton experience. She's from a border town and has lived there her whole life. She is a proud Texan of Mexican ancestry with a love love for story-telling. She wants to make movies to tell other people's stories. Still, she chose Princeton over Stanford because she felt she didn't know enough different personalities or identities in order to be a good story-teller. She is very responsible and a go-getter and figures things out for herself, in high-school she helped pay for the schooling of multiple of her siblings and still did well enough to get into both Princeton and Stanford (and a bunch of other great schools I'm sure). She is very interested in politics but hates moral absolutism even when it is concerning her own identities, which is very nice, challenging to someone like me and refreshing from a Princeton student. She speaks clearly and eloquently and seems mature for her age. She's different in a wonderful way and I think she is a great example of a time Princeton was doing something right. I think she would be really great for rush as she's an aspiring artist with an interesting point of view, I think she would be absolutely amazing for the Hall and Meeting, as a good questioner to remind us we really don't know everything and aren't that diverse in thought, and I think the Hall could do a lot for her and her time at Princeton.",
        "hall": 4,
        "meeting": 5,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "5n6bNbCWtV"
        },
        "objectId": "u4fZ89ljNf",
        "pb": 4,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "sYH8uLg3cz"
        },
        "updatedAt": "2015-09-30T22:57:23.674Z"
    },
	{
        "createdAt": "2015-10-07T16:57:13.982Z",
        "date": 5,
        "expanded": "I really, really liked Peyton. He's a chill guy, very solid. He's involved in Disiac and, not to stereotype here, but he seems like a genuinely grounded and kind and easy-going person. He was interested in the end in how As has affected my time here at Princeton, and why I enjoyed it and would recommend it, so he seemed to be rushing for the right reasons. I also don't think he \"needs\" to be in As. I'm not sure how much he would contribute to meeting. I would defer to Angie's judgment. Ultimately I think he's athletic (also on club basketball) and active in the community (big brother type service to Latino kids in the area) and is, in some of his \"way of being,\" different and a lot less cerebral than other members. He's also into science, wants to eventually be a doctor. He would bring diversity to the group, but I'm not sure whether he would contribute at meeting or frankly find most of the topics that we bring up super interesting. That's not necessarily a bad thing. I hope we stay in touch because, again, I really liked hanging out with him.",
        "hall": 3,
        "meeting": 2,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "BXD5r0f12R"
        },
        "objectId": "uBwT5Zfyi4",
        "pb": 4,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "fnvInk0b1X"
        },
        "updatedAt": "2015-10-07T16:57:13.982Z"
    },
	{
        "createdAt": "2015-09-23T17:34:04.237Z",
        "date": 3,
        "expanded": "The dude was really nice, and we had a nice conversation for about 50 minutes.  That said, I really don't think he would add very much to the hall in terms of diversity of opinion. Very genuine and bright, but as far as a different voice, not so much.",
        "hall": 3,
        "meeting": 3,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "EWlsIaZf5z"
        },
        "objectId": "uzW3eI5I04",
        "pb": 3,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "2IjCocxTzn"
        },
        "updatedAt": "2015-09-23T17:34:04.237Z"
    },
	{
        "createdAt": "2015-10-08T19:01:11.633Z",
        "date": 5,
        "expanded": "one of the few coffee dates i genuinely enjoyed. I think she'd be a good fit for the hall. we talked about music, politics, environmentalism. i think she could bring a valuable perspective to meeting, but also enjoy and participate in the social aspect of the hall. reminded me a lot of hetty.",
        "hall": 4,
        "meeting": 5,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "kldlMuEeNt"
        },
        "objectId": "vS0ayLVNbK",
        "pb": 4,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "s1Fv8LHOaQ"
        },
        "updatedAt": "2015-10-08T19:01:11.633Z"
    },
	{
        "createdAt": "2015-09-29T21:27:26.709Z",
        "date": 5,
        "expanded": "Abby is honestly pretty great. She's pretty easy going and seems really fun. Her parents own a bed and breakfast in upstate new york/middle of nowhere. She loves being from a small town which is really interesting to me especially since I'm from a big city. She asks really thoughtful questions and is a great listener. We chatted for an hour and the hour flew by. She is still looking for something to make her time at Princeton meaningful to her which I really related to. She reminded me quite a bit of myself when I was at that point in my time here. She seems really adventurous and loves 5 hour long walks in the woods. Her favorite books are randomly mostly by South African authors (she's worldly in her interests). She's debating between COS and History but loves both. She's desperate to see more of the world and push herself out of her comfort zone. She has a great sense of self but is open to new exciting things. She doesn't really like the street and feels kind of trapped here. I really liked this girl from talking to her. I literally want to mentor her on surviving Princeton while not prescribing to Princeton ideals. I think the Hall would do a lot of good for her and I think she would be a really great asset to a pledge class. I already feel super comfortable giving my PB to her which is something I really don't feel about many people.",
        "hall": 5,
        "meeting": 4,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "5n6bNbCWtV"
        },
        "objectId": "vVMUwmWFqM",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "CXwWRsVrR1"
        },
        "updatedAt": "2015-09-29T21:27:26.709Z"
    },
	{
        "createdAt": "2015-10-05T19:10:59.493Z",
        "date": 5,
        "expanded": "I really really really enjoyed the time i spent with him. two thumbs wayyyyyy up (i feel blessed). 10/10",
        "hall": 4,
        "meeting": 5,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "poXrQxuYrn"
        },
        "objectId": "viOG4zrZrF",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "psrcYsjgsY"
        },
        "updatedAt": "2015-10-05T19:10:59.493Z"
    },
	{
        "createdAt": "2015-10-03T20:25:50.284Z",
        "date": 4,
        "expanded": "I just had my coffee date with Nico and I found it to be very interesting. Unlike my other two coffee dates, this conversation mostly centered around abstract ideas about performance, which I thought was extremely interesting. Nico has a fascinating international and comprehensive world view and I definitely see that he's a very smart guy as well. Some of his ideas about the influence of senses in relation to performance are intriguing and extremely cutting edge. At the same time, our conversation didn't really show a lot of vulnerability on his end. We talked a lot about ideas but I kind of had to encourage him to open up about personal details, rather than just reverting to abstract thoughts. I love intellectual conversations, but I feel that if I don't have a human emotion speaking from behind the idea, there's not real longevity to the experience. However, talking about his past it became clear that he \"learned how to perform a part,\" with respect to his adopting of different identities based on context - Nico moved almost every 2 years for most of his life, living everywhere from Nashville to Abu Dhabi. This habit of \"adjusting the self\" in order to fit into different social contexts was sometimes clear during our conversation; I felt that he wanted me to like him more than he wanted to present himself vulnerably to feel the thrill of sincerity. One thing that I love about the Hall is that people are apologetically themselves, and I feel Nico would learn to open up more genuinely. That's the tricky thing about coffee dating people for the Hall. I feel like so many of my coffee dates would grow exponentially being involved in a group such as A's, but the only way that can happen is if there are people who are unashamedly themselves who can model openness for others.",
        "hall": 5,
        "meeting": 4,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "SmBf5on1pc"
        },
        "objectId": "vizCW98CIO",
        "pb": 3,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "zydDj0wlxO"
        },
        "updatedAt": "2015-10-03T20:25:50.284Z"
    },
	{
        "createdAt": "2015-10-06T00:46:22.973Z",
        "date": 5,
        "expanded": "I LOVED BETH! She was genuine, bubbly, happy, and a really good listener. She gave me a great snapshot into who she is as a person just through our hour together. I think she has a lot to contribute to the Hall and also how that the Hall has a lot that they can provide her. She's from Kansas City, was head cheerleader in high school, and sings for the Tigressions, which definitely would add some diversity. She spun a great story of her summer home in Kansas City, and talked at length about her connection to home intertwined with her fear of it changing without her. She's in the art history department interested in ancient art (wtf...I hate ancient art). We talked about loneliness even on such a vibrant campus and about her love for her little brother. She was also just an unbelievably fun person to be around. She definitely brought up the mood of my day as well as made me think about our coffee date for a couple of hours afterwards. I think she would really benefit from being in a group of people that aren't her current crowd, and she would contribute a lot to meeting, after getting over some initial shyness.",
        "hall": 5,
        "meeting": 4,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "pAMJgmz7nJ"
        },
        "objectId": "vkpA2YYkAw",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "A6U5bDZZxL"
        },
        "updatedAt": "2015-10-06T00:46:22.973Z"
    },
	{
        "createdAt": "2015-10-05T03:16:13.788Z",
        "date": 5,
        "expanded": "I knew two minutes into the conversation that Evan should be in As. This is my fourth coffee date and it suddenly became clear to me how you're able to tell that somebody should be a member of this organization. He was curious but had his own opinions. He's articulate and has a background that's not quite like anybody else's (military, moved around a lot with his father). He's thoughtful and an excellent listener and super engaging and he strikes me as very empathetic and understanding; I would feel comfortable delivering my PB to him. And at the end of the conversation, he didn't ask me when rush is over, but he asked me how I feel like As has changed my Princeton experience (I remember asking Brother Dercon the same question at the end of our coffee date). I think he's in As for the right motives. I think he's down to have some great conversations and be generally a solid and thoughtful dude. I think this is a friend group he doesn't have access to right now. And ultimately I don't feel compelled to write a lot for Evan because I think he'd be an awesome member of As, hands down.",
        "hall": 5,
        "meeting": 5,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "BXD5r0f12R"
        },
        "objectId": "vwRiBNC1tU",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "GnSQLHo5ts"
        },
        "updatedAt": "2015-10-05T03:16:13.788Z"
    },
	{
        "createdAt": "2015-10-03T21:04:30.058Z",
        "date": 4,
        "expanded": "Leila is super smart and has an interesting story. We had a great wide ranging conversation, stuff from literature to foreign affairs to our families. She is a little shy and awkward, and seemed pretty nervous. While the coffee date went well, she gave me the sense that she'd be a little uncomfortable with certain parts of the Hall's culture. I think Leila could definitely contribute to the meeting, but I'm not sure the Hall is the best fit for her, personality-wise.",
        "hall": 3,
        "meeting": 4,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "kldlMuEeNt"
        },
        "objectId": "vzBv8JcMl1",
        "pb": 3,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "qodZHt0pm4"
        },
        "updatedAt": "2015-10-03T21:04:30.058Z"
    },
	{
        "createdAt": "2015-10-08T18:58:12.599Z",
        "date": 5,
        "expanded": "My conversation with Alexander was phenomenal. To begin, he is an incredibly self-aware individual with a wealth of experiences to draw from. Born in Atlanta, raised in Kenya and South Africa respectively and now landing in Princeton, Alexander’s constant relocation is one thing that makes him special. There were a couple key moments for me during our talk. First, I was basically late to our coffee date and despite this there was no awkward beginning or introduction. Like old friends, we dived into a conversation about self-presentation and self-consciousness. From there, we began to discuss life at Princeton, his family, his studies, and our shared love of Toni Morrison and her novel, Beloved. What struck me most about my conversation with Alexander was not the length (though it did go on for a while and we only seemed to scratch the surface), but how organic it all was. There was never a moment where things were awkward. Instead, silences were merely times for us to take a sip of our coffee and comfortably observe our surroundings. I would love to see Alexander in St. A’s because I think he would have a lot to offer to our class. Not only is he incredibly intelligent -- with a diverse range of interests from history to philosophy to race studies-- but he is un-pompously self-aware. It is the kind of self-aware that acknowledges its privilege and understands that there is much more to learn. I am excited to hear what others have to say about him, but for me, it is definitely a yes.",
        "hall": 5,
        "meeting": 5,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "xt5DyqVpe4"
        },
        "objectId": "w0Ah3oN2xX",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "AWFFDvfOWa"
        },
        "updatedAt": "2015-10-08T18:58:12.599Z"
    },
	{
        "createdAt": "2015-10-07T18:14:44.705Z",
        "date": 3,
        "expanded": "I enjoyed getting to know Adetobi. We spoke about a bunch of stuff and it all felt pretty natural and I was very comfortable in her presence. Bear in mind I am writing this very late in the coffee date process, but I think its worth saying that my conversation with Adetobi never took off in the amazing way that some of my other coffee dates have done this and last year. We spoke about a lot of different things and had some good laughs together but there was a lot of switching and I never felt like I was really getting a good sense of what Adetobi is like and what she cares about.",
        "hall": 3,
        "meeting": 3,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "55fH46Ihxf"
        },
        "objectId": "w1j9UqNCeq",
        "pb": 4,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "Xoofwx7BUj"
        },
        "updatedAt": "2015-10-07T18:14:44.705Z"
    },
	{
        "createdAt": "2015-10-02T02:37:13.365Z",
        "date": 3,
        "expanded": "Talking with Amina was fine, but nothing special. I felt like I offered most of the substance to the conversation, and when probed about deeper / more interesting topics she sort of agreed that they were interesting and complex and settled with \"yeah, I don't really know!\" Not in an unenthusiastic way, just not in a very contributing way. I had a fine time and I would be fine seeing her in the Hall if other people have very favorable interactions with her, but for me it was sort of a meh coffee date.",
        "hall": 3,
        "meeting": 2,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "eOOl5GK2aQ"
        },
        "objectId": "wUBkV5kGOJ",
        "pb": 4,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "3CyUGtpVq5"
        },
        "updatedAt": "2015-10-02T02:37:13.365Z"
    },
	{
        "createdAt": "2015-10-08T20:17:08.220Z",
        "date": 4,
        "expanded": "Michele was nice and the coffee date was pretty chill, but I didn't really sense a very friendly energy from her. I'm not saying that every member of the hall should be kittens and sunshine, but she just didn't really seem to give a shit about the conversation we were having. It sort of felt like a formality - having the conversation. I thought she was funny and she got really excited when we talked about certain subjects, but she seemed generally unenthused. I don't think she does very well with listening and she didn't really engage me by asking any questions; we sort of just took turns telling personally anecdotes. I tried to ask follow up questions to get a little bit more interaction out of her stories, but she would change the subject and kept the conversation very surface-level.",
        "hall": 2,
        "meeting": 2,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "SmBf5on1pc"
        },
        "objectId": "xBZWSla7Wo",
        "pb": 2,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "RLETfJcJ0C"
        },
        "updatedAt": "2015-10-08T20:17:08.220Z"
    },
	{
        "createdAt": "2015-10-03T23:55:56.002Z",
        "date": 4,
        "expanded": "Sam is clearly a good guy who really wants to get into a's - and not for bad reasons - but I wasn't soo excited about the potential of him joining. Its not that he wouldn't be a good member. He is clearly interested in getting to know people on a deeper level and participating in interesting communities. But at the same time I wasn't blown away. I wish I had been, because I know he would be really happy to become a member. That being said, I'm not sure he would be in the top 15 people I would want to join the hall. But he could be... I am interested to hear how other people felt about him (I know he had two previous coffee dates - one with JD and one with Aubree).",
        "hall": 5,
        "meeting": 3,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "kSGEshJdTB"
        },
        "objectId": "xE24sjZKBH",
        "pb": 4,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "OFZApgScL1"
        },
        "updatedAt": "2015-10-03T23:55:56.002Z"
    },
	{
        "createdAt": "2015-09-24T14:36:11.999Z",
        "date": 4,
        "expanded": "Devyn was pretty awesome. We only had about an hour at 9am because she had class at 10 but in that short time I gained a lot of respect for her. She talked about how this year she wanted to expand her perspective and challenge her old ways of thinking. She seems really bright and also a very different voice. I think she would be a great contribution to meetings and I felt comfortable around her.",
        "hall": 5,
        "meeting": 5,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "EWlsIaZf5z"
        },
        "objectId": "xPOFP0GdkG",
        "pb": 4,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "BfK1tJcREr"
        },
        "updatedAt": "2015-09-24T14:36:11.999Z"
    },
	{
        "createdAt": "2015-09-28T01:25:41.511Z",
        "date": 3,
        "expanded": "I enjoyed my coffee date with Winny and conversation came fairly naturally. She seemed a bit nervous and reserved at first, but after fifteen minutes or so she began to open up more. We got to talking about my year off and the time I spent in Myanmar, which just so happens to be where she was born and lived up until coming to Princeton. Our discussion of Burmese culture, her experience growing up there, the vast differences in our impressions of the country, ultimately led us to talking about her ancestry and how each side of her family had fortuitously landed in Burma. Her history was really fascinating and it's always lovely hearing about someone's experience that is so dramatically different from my own.\n\nWe talked a lot about school, flip-flopping majors, the ever-confusing social scene. She had a lot of difficulty adjusting to Princeton freshman fall (it was, after all, the first time she'd set foot on American soil), so we did our fair share of bemoaning campus' shortcomings--and ultimately coming to that sort of chapter-ending necessary conclusion that we've got nothing real to complain about, we're so lucky to be here, all that jazz. She seems to have adopted a much more positive outlook on school, which is great, but also mentioned that she's fairly intent on going abroad in the spring.\n\nOnce Winny got to opening up, she wasn't shy about sharing at all. One thing that she shared that made me a little uncomfortable was a prolonged tangent about a girl she knew from home, which sort of just segued into gossip about someone I knew nothing about. It was just a series of stories about a girl who had allegedly lied about getting into Princeton (which came up because we were talking about how she is the only student from Burma on campus) and became a 20-minute grumble about the girl being a compulsive liar--I don't know, it wasn't so much any sort of mean-spirited attitude that got to me, but more the fact that it was just a closed-off topic of conversation that I couldn't contribute to in any way.\n\nBut overall, I enjoyed our conversation and learned a lot about her. The main reasons for the lukewarm ratings are that the conversation was pretty one-sided, she didn't really ask me any questions--about myself or about A's--and that there just wasn't really a spark. She was certainly very friendly and open, but we didn't really hit it off in a major way and didn't delve deeply into any non-superficial subjects. That's mainly why I can't fully envision her in the group dynamic and am unsure of how she might contribute to the meeting atmosphere. Just the vibez, u kno.",
        "hall": 3,
        "meeting": 3,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "6NmejqZ4eu"
        },
        "objectId": "xVQ2zeD8fx",
        "pb": 3,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "58EqI4xBtK"
        },
        "updatedAt": "2015-09-28T01:25:41.511Z"
    },
	{
        "createdAt": "2015-10-08T18:49:36.213Z",
        "date": 4,
        "expanded": "Dipo is a wonderful guy. In all honesty, I came into this cd having heard lots of good things about him and I have to say that I completely agree. His brain works in such a different way and just hearing him explain things were pretty awesome. A conversation about the benefits of meditation involved wealth and diminishing returns, isomorphic structures in daily habits and some algorithm stuff about time and space efficiency which I didn't really understand. I think he would be a really different perspective in LDs and even though I would never hear his pb I think it would be absolutely brilliant. I don't really know how much he'd enjoy the pledging process but I would defer to people who know him better.",
        "hall": 4,
        "meeting": 5,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "55fH46Ihxf"
        },
        "objectId": "xX0hKcie4R",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "80YfRKQRV0"
        },
        "updatedAt": "2015-10-08T18:49:36.213Z"
    },
	{
        "createdAt": "2015-10-03T21:06:52.202Z",
        "date": 3,
        "expanded": "Sebastian loves to talk. And at first that was a nice change from some of the other coffee dates. But at a certain point he just sort of started monologuing. This isn't to say that his monolog was boring--I learned a ton about the history of UK electronic music and grime. But it seemed like Sebastian was having some trouble reading non-verbal queues. He has a fascinating story and is one of those people who is more than what you think when you first see him, but I'm unsure if the Hall is a good fit for him.",
        "hall": 3,
        "meeting": 3,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "kldlMuEeNt"
        },
        "objectId": "ynUjsjQm9g",
        "pb": 3,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "U4IpoGXw5T"
        },
        "updatedAt": "2015-10-03T21:06:52.202Z"
    },
	{
        "createdAt": "2015-10-03T20:33:33.068Z",
        "date": 5,
        "expanded": "Yes. Perfect.",
        "hall": 5,
        "meeting": 5,
        "member": {
            "__type": "Pointer",
            "className": "Member",
            "objectId": "kcwZSbfWQv"
        },
        "objectId": "yrrdMBm5Zx",
        "pb": 5,
        "rushee": {
            "__type": "Pointer",
            "className": "Rushee",
            "objectId": "CksZqHste9"
        },
        "updatedAt": "2015-10-03T20:33:33.068Z"
    }
] }